[
	{
		"title": "Program Guided Agent",
		"authors": "Shao-Hua Sun,Te-Lin Wu,Joseph J. Lim",
		"emails": "shaohuas@usc.edu, telinwu@usc.edu, limjj@usc.edu",
		"TL;DR:": "We propose a modular framework that can accomplish tasks specified by programs and achieve zero-shot generalization to more complex tasks.",
		"Abstract:": "Developing agents that can learn to follow natural language instructions has been an emerging research direction. While being accessible and flexible, natural language instructions can sometimes be ambiguous even to humans. To address this, we propose to utilize programs, structured in a formal language, as a precise and expressive way to specify tasks. We then devise a modular framework that learns to perform a task specified by a program – as different circumstances give rise to diverse ways to accomplish the task, our framework can perceive which circumstance it is currently under, and instruct a multitask policy accordingly to fulfill each subtask of the overall task. Experimental results on a 2D Minecraft environment not only demonstrate that the proposed framework learns to reliably accomplish program instructions and achieves zero-shot generalization to more complex instructions but also verify the efficiency of the proposed modulation mechanism for learning the multitask policy. We also conduct an analysis comparing various models which learn from programs and natural language instructions in an end-to-end fashion.",
		"Keywords:": "Program Execution, Program Executor, Program Understanding, Program Guided Agent, Learning to Execute, Deep Learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BkxUvnEYDH",
		"pdf_link": "https://openreview.net/pdf?id=BkxUvnEYDH"
	},
	{
		"title": "Sparse Coding with Gated Learned ISTA",
		"authors": "Kailun Wu,Yiwen Guo,Ziang Li,Changshui Zhang",
		"emails": "wukl14@mails.tsinghua.edu.cn, guoyiwen.ai@bytedance.com, liza19@mails.tsinghua.edu.cn, zcs@mail.tsinghua.edu.cn",
		"TL;DR:": "We propose gated mechanisms to enhance learned ISTA for sparse coding, with theoretical guarantees on the superiority of the method.",
		"Abstract:": "In this paper, we study the learned iterative shrinkage thresholding algorithm (LISTA) for solving sparse coding problems.  Following assumptions made by prior works, we first discover that the code components in its estimations may be lower than expected, i.e., require gains, and to address this problem, a gated mechanism amenable to theoretical analysis is then introduced. Specific design of the gates is inspired by convergence analyses of the mechanism and hence its effectiveness can be formally guaranteed. In addition to the gain gates, we further introduce overshoot gates for compensating insufficient step size in LISTA. Extensive empirical results confirm our theoretical findings and verify the effectiveness of our method.",
		"Keywords:": "Sparse coding, deep learning, learned ISTA, convergence analysis",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BygPO2VKPH",
		"pdf_link": "https://openreview.net/pdf?id=BygPO2VKPH",
		"Code:": "https://github.com/wukailun/GLISTA"
	},
	{
		"title": "Graph Neural Networks Exponentially Lose Expressive Power for Node Classification",
		"authors": "Kenta Oono,Taiji Suzuki",
		"emails": "kenta_oono@mist.i.u-tokyo.ac.jp, taiji@mist.i.u-tokyo.ac.jp",
		"TL;DR:": "We relate the asymptotic behavior of graph neural networks to the graph spectra of underlying graphs and gives principled guidelines for normalizing weights.",
		"Abstract:": "Graph Neural Networks (graph NNs) are a promising deep learning approach for analyzing graph-structured data. However, it is known that they do not improve (or sometimes worsen) their predictive performance as we pile up many layers and add non-lineality. To tackle this problem, we investigate the expressive power of graph NNs via their asymptotic behaviors as the layer size tends to infinity.\n      Our strategy is to generalize the forward propagation of a Graph Convolutional Network (GCN), which is a popular graph NN variant, as a specific dynamical system. In the case of a GCN, we show that when its weights satisfy the conditions determined by the spectra of the (augmented) normalized Laplacian, its output exponentially approaches the set of signals that carry information of the connected components and node degrees only for distinguishing nodes.\n      Our theory enables us to relate the expressive power of GCNs with the topological information of the underlying graphs inherent in the graph spectra. To demonstrate this, we characterize the asymptotic behavior of GCNs on the Erd\\H{o}s -- R\\'{e}nyi graph.\n      We show that when the Erd\\H{o}s -- R\\'{e}nyi graph is sufficiently dense and large, a broad range of GCNs on it suffers from the ``information loss\" in the limit of infinite layers with high probability.\n      Based on the theory, we provide a principled guideline for weight normalization of graph NNs. We experimentally confirm that the proposed weight scaling enhances the predictive performance of GCNs in real data. Code is available athttps://github.com/delta2323/gnn-asymptotics.",
		"Keywords:": "Graph Neural Network, Deep Learning, Expressive Power",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=S1ldO2EFPr",
		"pdf_link": "https://openreview.net/pdf?id=S1ldO2EFPr",
		"Code:": "https://github.com/delta2323/gnn-asymptotics"
	},
	{
		"title": "Multi-Scale Representation Learning  for Spatial Feature Distributions using Grid Cells",
		"authors": "Gengchen Mai,Krzysztof Janowicz,Bo Yan,Rui Zhu,Ling Cai,Ni Lao",
		"emails": "gengchen_mai@geog.ucsb.edu, janowicz@ucsb.edu, boyan1@linkedin.com, ruizhu@geog.ucsb.edu, lingcai@ucsb.edu, noon99@gmail.com",
		"TL;DR:": "We propose a representation learning model called Space2vec to encode the absolute positions and spatial relationships of places.",
		"Abstract:": "Unsupervised text encoding models have recently fueled substantial progress in NLP. The key idea is to use neural networks to convert words in texts to vector space representations (embeddings) based on word positions in a sentence and their contexts, which are suitable for end-to-end training of downstream tasks. We see a strikingly similar situation in spatial analysis, which focuses on incorporating both absolute positions and spatial contexts of geographic objects such as POIs into models. A general-purpose representation model for space is valuable for a multitude of tasks. However, no such general model exists to date beyond simply applying discretization or feed-forward nets to coordinates, and little effort has been put into jointly modeling distributions with vastly different characteristics, which commonly emerges from GIS data. Meanwhile, Nobel Prize-winning Neuroscience research shows that grid cells in mammals provide a multi-scale periodic representation that functions as a metric for location encoding and is critical for recognizing places and for path-integration. Therefore, we propose a representation learning model called Space2Vec to encode the absolute positions and spatial relationships of places. We conduct experiments on two real-world geographic data for two different tasks: 1) predicting types of POIs given their positions and context, 2) image classification leveraging their geo-locations. Results show that because of its multi-scale representations, Space2Vec outperforms well-established ML approaches such as RBF kernels, multi-layer feed-forward nets, and tile embedding approaches for location modeling and image classification tasks. Detailed analysis shows that all baselines can at most well handle distribution at one scale but show poor performances in other scales. In contrast, Space2Vec ’s multi-scale representation can handle distributions at different scales.",
		"Keywords:": "Grid cell, space encoding, spatially explicit model, multi-scale periodic representation, unsupervised learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rJljdh4KDH",
		"pdf_link": "https://openreview.net/pdf?id=rJljdh4KDH",
		"Code:": "https://github.com/gengchenmai/space2vec"
	},
	{
		"title": "InfoGraph: Unsupervised and Semi-supervised Graph-Level Representation Learning via Mutual Information Maximization",
		"authors": "Fan-Yun Sun,Jordan Hoffman,Vikas Verma,Jian Tang",
		"emails": "sunfanyun@gmail.com, jhoffmann@g.harvard.edu, vikasverma.iitm@gmail.com, jian.tang@hec.ca",
		"TL;DR:": "We propose a representation learning model called Space2vec to encode the absolute positions and spatial relationships of places.",
		"Abstract:": "This paper studies learning the representations of whole graphs in both unsupervised and semi-supervised scenarios. Graph-level representations are critical in a variety of real-world applications such as predicting the properties of molecules and community analysis in social networks. Traditional graph kernel based methods are simple, yet effective for obtaining fixed-length representations for graphs but they suffer from poor generalization due to hand-crafted designs. There are also some recent methods based on language models (e.g. graph2vec) but they tend to only consider certain substructures (e.g. subtrees) as graph representatives. Inspired by recent progress of unsupervised representation learning, in this paper we proposed a novel method called InfoGraph for learning graph-level representations. We maximize the mutual information between the graph-level representation and the representations of substructures of different scales (e.g., nodes, edges, triangles). By doing so, the graph-level representations encode aspects of the data that are shared across different scales of substructures. Furthermore, we further propose InfoGraph*, an extension of InfoGraph for semisupervised scenarios. InfoGraph* maximizes the mutual information between unsupervised graph representations learned by InfoGraph and the representations learned by existing supervised methods. As a result, the supervised encoder learns from unlabeled data while preserving the latent semantic space favored by the current supervised task. Experimental results on the tasks of graph classification and molecular property prediction show that InfoGraph is superior to state-of-the-art baselines and InfoGraph* can achieve performance competitive with state-of-the-art semi-supervised models.",
		"Keywords:": "graph-level representation learning, mutual information maximization",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=r1lfF2NYvH",
		"pdf_link": "https://openreview.net/pdf?id=r1lfF2NYvH",
		"Code:": "https://github.com/fanyun-sun/InfoGraph"
	},
	{
		"title": "On Robustness of Neural Ordinary Differential Equations",
		"authors": "Hanshu YAN,Jiawei DU,Vincent TAN,Jiashi FENG",
		"emails": "hanshu.yan@u.nus.edu, dujiawei@u.nus.edu, vtan@nus.edu.sg, elefjia@nus.edu.sg",
		"TL;DR:": "We propose a representation learning model called Space2vec to encode the absolute positions and spatial relationships of places.",
		"Abstract:": "Neural ordinary differential equations (ODEs) have been attracting increasing attention in various research domains recently.  There have been some works studying optimization issues and approximation capabilities of neural ODEs, but their robustness is still yet unclear. In this work, we fill this important gap by exploring robustness properties of neural ODEs both empirically and theoretically. We first present an empirical study on the robustness of the neural ODE-based networks (ODENets) by exposing them to inputs with various types of perturbations and subsequently investigating the changes of the corresponding outputs. In contrast to conventional convolutional neural networks (CNNs), we find that the ODENets are more robust against both random Gaussian perturbations and adversarial attack examples. We then provide an insightful understanding of this phenomenon by exploiting a certain desirable property of the flow of a continuous-time ODE, namely that integral curves are non-intersecting. Our work suggests that, due to their intrinsic robustness, it is promising to use neural ODEs as a basic block for building robust deep network models. To further enhance the robustness of vanilla neural ODEs, we propose the time-invariant steady neural ODE (TisODE), which regularizes the flow on perturbed data via the time-invariant property and the imposition of a steady-state constraint. We show that the TisODE method outperforms vanilla neural ODEs and also can work in conjunction with other state-of-the-art architectural methods to build more robust deep networks.",
		"Keywords:": "Neural ODE",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=B1e9Y2NYvS",
		"pdf_link": "https://openreview.net/pdf?id=B1e9Y2NYvS",
		"Code:": "https://github.com/fanyun-sun/InfoGraph"
	},
	{
		"title": "Defending Against Physically Realizable Attacks on Image Classification",
		"authors": "Tong Wu,Liang Tong,Yevgeniy Vorobeychik",
		"emails": "tongwu@wustl.edu, liangtong@wustl.edu, yvorobeychik@wustl.edu",
		"TL;DR:": "Defending Against Physically Realizable Attacks on Image Classification",
		"Abstract:": "We study the problem of defending deep neural network approaches for image classification from physically realizable attacks. First, we demonstrate that the two most scalable and effective methods for learning robust models, adversarial training with PGD attacks and randomized smoothing, exhibit very limited effectiveness against three of the highest profile physical attacks. Next, we propose a new abstract adversarial model, rectangular occlusion attacks, in which an adversary places a small adversarially crafted rectangle in an image, and develop two approaches for efficiently computing the resulting adversarial examples. Finally, we demonstrate that adversarial training using our new attack yields image classification models that exhibit high robustness against the physically realizable attacks we study, offering the first effective generic defense against such attacks.",
		"Keywords:": "defense against physical attacks, adversarial machine learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=H1xscnEKDr",
		"pdf_link": "https://openreview.net/pdf?id=H1xscnEKDr",
		"Code:": "https://github.com/tongwu2020/phattacks"
	},
	{
		"title": "Estimating Gradients for Discrete Random Variables by Sampling without Replacement",
		"authors": "Wouter Kool,Herke van Hoof,Max Welling",
		"emails": "w.w.m.kool@uva.nl, h.c.vanhoof@uva.nl, m.welling@uva.nl",
		"TL;DR:": "We derive a low-variance, unbiased gradient estimator for expectations over discrete random variables based on sampling without replacement",
		"Abstract:": "We derive an unbiased estimator for expectations over discrete random variables based on sampling without replacement, which reduces variance as it avoids duplicate samples. We show that our estimator can be derived as the Rao-Blackwellization of three different estimators. Combining our estimator with REINFORCE, we obtain a policy gradient estimator and we reduce its variance using a built-in control variate which is obtained without additional model evaluations. The resulting estimator is closely related to other gradient estimators. Experiments with a toy problem, a categorical Variational Auto-Encoder and a structured prediction problem show that our estimator is the only estimator that is consistently among the best estimators in both high and low entropy settings.",
		"Keywords:": "gradient, estimator, discrete, categorical, sampling, without replacement, reinforce, baseline, variance, gumbel, vae, structured prediction",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rklEj2EFvB",
		"pdf_link": "https://openreview.net/pdf?id=rklEj2EFvB",
		"Code:": "https://github.com/wouterkool/estimating-gradients-without-replacement"
	},
	{
		"title": "Learning to Control PDEs with Differentiable Physics",
		"authors": "Philipp Holl,Nils Thuerey,Vladlen Koltun",
		"emails": "philipp.holl@tum.de, nils.thuerey@tum.de, vkoltun@gmail.com",
		"TL;DR:": "We train a combination of neural networks to predict optimal trajectories for complex physical systems.",
		"Abstract:": "Predicting outcomes and planning interactions with the physical world are long-standing goals for machine learning. A variety of such tasks involves continuous physical systems, which can be described by partial differential equations (PDEs) with many degrees of freedom. Existing methods that aim to control the dynamics of such systems are typically limited to relatively short time frames or a small number of interaction parameters. We present a novel hierarchical predictor-corrector scheme which enables neural networks to learn to understand and control complex nonlinear physical systems over long time frames. We propose to split the problem into two distinct tasks: planning and control. To this end, we introduce a predictor network that plans optimal trajectories and a control network that infers the corresponding control parameters. Both stages are trained end-to-end using a differentiable PDE solver. We demonstrate that our method successfully develops an understanding of complex physical systems and learns to control them for tasks involving PDEs such as the incompressible Navier-Stokes equations.",
		"Keywords:": "Differentiable physics, Optimal control, Deep learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=HyeSin4FPB",
		"pdf_link": "https://openreview.net/pdf?id=HyeSin4FPB",
		"Code:": "https://github.com/wouterkool/estimating-gradients-without-replacement"
	},
	{
		"title": "Intensity-Free Learning of Temporal Point Processes",
		"authors": "Oleksandr Shchur,Marin Biloš,Stephan Günnemann",
		"emails": "shchur@in.tum.de, bilos@in.tum.de, guennemann@in.tum.de",
		"TL;DR:": "Learn in temporal point processes by modeling the conditional density, not the conditional intensity.",
		"Abstract:": "Temporal point processes are the dominant paradigm for modeling sequences of events happening at irregular intervals. The standard way of learning in such models is by estimating the conditional intensity function.  However, parameterizing the intensity function usually incurs several trade-offs. We show how to overcome the limitations of intensity-based approaches by directly modeling the conditional distribution of inter-event times.  We draw on the literature on normalizing flows to design models that are flexible and efficient. We additionally propose a simple mixture model that matches the flexibility of flow-based models, but also permits sampling and computing moments in closed form.  The proposed models achieve state-of-the-art performance in standard prediction tasks and are suitable for novel applications, such as learning sequence embeddings and imputing missing data.",
		"Keywords:": "Temporal point process, neural density estimation",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=HygOjhEYDH",
		"pdf_link": "https://openreview.net/pdf?id=HygOjhEYDH",
		"Code:": "https://github.com/shchur/ifl-tpp"
	},
	{
		"title": "A Signal Propagation Perspective for Pruning Neural Networks at Initialization",
		"authors": "Namhoon Lee,Thalaiyasingam Ajanthan,Stephen Gould,Philip H. S. Torr",
		"emails": "namhoon@robots.ox.ac.uk, thalaiyasingam.ajanthan@anu.edu.au, stephen.gould@anu.edu.au, phst@robots.ox.ac.uk",
		"TL;DR:": "We formally characterize the initialization conditions for effective pruning at initialization and analyze the signal propagation properties of the resulting pruned networks which leads to a method to enhance their trainability and pruning results.",
		"Abstract:": "Network pruning is a promising avenue for compressing deep neural networks. A typical approach to pruning starts by training a model and then removing redundant parameters while minimizing the impact on what is learned. Alternatively, a recent approach shows that pruning can be done at initialization prior to training, based on a saliency criterion called connection sensitivity. However, it remains unclear exactly why pruning an untrained, randomly initialized neural network is effective. In this work, by noting connection sensitivity as a form of gradient, we formally characterize initialization conditions to ensure reliable connection sensitivity measurements, which in turn yields effective pruning results. Moreover, we analyze the signal propagation properties of the resulting pruned networks and introduce a simple, data-free method to improve their trainability. Our modifications to the existing pruning at initialization method lead to improved results on all tested network models for image classification tasks. Furthermore, we empirically study the effect of supervision for pruning and demonstrate that our signal propagation perspective, combined with unsupervised pruning, can be useful in various scenarios where pruning is applied to non-standard arbitrarily-designed architectures.",
		"Keywords:": "neural network pruning, signal propagation perspective, sparse neural networks",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=HJeTo2VFwH",
		"pdf_link": "https://openreview.net/pdf?id=HJeTo2VFwH",
		"Code:": "https://github.com/shchur/ifl-tpp"
	},
	{
		"title": "Skip Connections Matter: On the Transferability of Adversarial Examples Generated with ResNets",
		"authors": "Dongxian Wu,Yisen Wang,Shu-Tao Xia,James Bailey,Xingjun Ma",
		"emails": "wu-dx16@mails.tsinghua.edu.cn, eewangyisen@gmail.com, xiast@sz.tsinghua.edu.cn, baileyj@unimelb.edu.au, xingjun.ma@unimelb.edu.au",
		"TL;DR:": "We identify the security weakness of skip connections in ResNet-like neural networks",
		"Abstract:": "Skip connections are an essential component of current state-of-the-art deep neural networks (DNNs) such as ResNet, WideResNet, DenseNet, and ResNeXt. Despite their huge success in building deeper and more powerful DNNs, we identify a surprising \\emph{security weakness} of skip connections in this paper. Use of skip connections \\textit{allows easier generation of highly transferable adversarial examples}. Specifically, in ResNet-like (with skip connections) neural networks, gradients can backpropagate through either skip connections or residual modules. We find that using more gradients from the skip connections rather than the residual modules according to a decay factor, allows one to craft adversarial examples with high transferability. Our method is termed \\emph{Skip Gradient Method} (SGM). We conduct comprehensive transfer attacks against state-of-the-art DNNs including ResNets, DenseNets, Inceptions, Inception-ResNet, Squeeze-and-Excitation Network (SENet) and robustly trained DNNs. We show that employing SGM on the gradient flow can greatly improve the transferability of crafted attacks in almost all cases. Furthermore, SGM can be easily combined with existing black-box attack techniques, and obtain high improvements over state-of-the-art transferability methods. Our findings not only motivate new research into the architectural vulnerability of DNNs, but also open up further challenges for the design of secure DNN architectures.",
		"Keywords:": "Adversarial Example, Transferability, Skip Connection, Neural Network",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BJlRs34Fvr",
		"pdf_link": "https://openreview.net/pdf?id=BJlRs34Fvr",
		"Code:": "https://github.com/shchur/ifl-tpp"
	},
	{
		"title": "White Noise Analysis of Neural Networks",
		"authors": "Ali Borji,Sikun Lin",
		"emails": "aliborji@gmail.com, sikun@ucsb.edu",
		"TL;DR:": "We identify the security weakness of skip connections in ResNet-like neural networks",
		"Abstract:": "A white noise analysis of modern deep neural networks is presented to unveil\n      their biases at the whole network level or the single neuron level. Our analysis is\n      based on two popular and related methods in psychophysics and neurophysiology\n      namely classification images and spike triggered analysis. These methods have\n      been widely used to understand the underlying mechanisms of sensory systems\n      in humans and monkeys. We leverage them to investigate the inherent biases of\n      deep neural networks and to obtain a first-order approximation of their functionality.\n      We emphasize on CNNs since they are currently the state of the art methods\n      in computer vision and are a decent model of human visual processing. In\n      addition, we study multi-layer perceptrons, logistic regression, and recurrent neural\n      networks. Experiments over four classic datasets, MNIST, Fashion-MNIST,\n      CIFAR-10, and ImageNet, show that the computed bias maps resemble the target\n      classes and when used for classification lead to an over two-fold performance than\n      the chance level. Further, we show that classification images can be used to attack\n      a black-box classifier and to detect adversarial patch attacks. Finally, we utilize\n      spike triggered averaging to derive the filters of CNNs and explore how the behavior\n      of a network changes when neurons in different layers are modulated. Our\n      effort illustrates a successful example of borrowing from neurosciences to study\n      ANNs and highlights the importance of cross-fertilization and synergy across machine\n      learning, deep learning, and computational neuroscience.",
		"Keywords:": "Classification images, spike triggered analysis, deep learning, network visualization, adversarial attack, adversarial defense, microstimulation, computational neuroscience",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=H1ebhnEYDH",
		"pdf_link": "https://openreview.net/pdf?id=H1ebhnEYDH",
		"Code:": "https://github.com/aliborji/WhiteNoiseAnalysis.git"
	},
	{
		"title": "Neural Machine Translation with Universal Visual Representation",
		"authors": "Zhuosheng Zhang,Kehai Chen,Rui Wang,Masao Utiyama,Eiichiro Sumita,Zuchao Li,Hai Zhao",
		"emails": "zhangzs@sjtu.edu.cn, khchen@nict.go.jp, wangrui@nict.go.jp, mutiyama@nict.go.jp, eiichiro.sumita@nict.go.jp, charlee@sjtu.edu.cn, zhaohai@cs.sjtu.edu.cn",
		"TL;DR:": "This work proposed a universal visual representation for neural machine translation (NMT) using retrieved images with similar topics to source sentence,  extending image applicability in NMT.",
		"Abstract:": "Though visual information has been introduced for enhancing neural machine translation (NMT), its effectiveness strongly relies on the availability of large amounts of bilingual parallel sentence pairs with manual image annotations. In this paper, we present a universal visual representation learned over the monolingual corpora with image annotations, which overcomes the lack of large-scale bilingual sentence-image pairs, thereby extending image applicability in NMT. In detail, a group of images with similar topics to the source sentence will be retrieved from a light topic-image lookup table learned over the existing sentence-image pairs, and then is encoded as image representations by a pre-trained ResNet. An attention layer with a gated weighting is to fuse the visual information and text information as input to the decoder for predicting target translations. In particular, the proposed method enables the visual information to be integrated into large-scale text-only NMT in addition to the multimodel NMT. Experiments on four widely used translation datasets, including the WMT'16 English-to-Romanian, WMT'14 English-to-German, WMT'14 English-to-French, and Multi30K, show that the proposed approach achieves significant improvements over strong baselines.",
		"Keywords:": "Neural Machine Translation, Visual Representation, Multimodal Machine Translation, Language Representation",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=Byl8hhNYPS",
		"pdf_link": "https://openreview.net/pdf?id=Byl8hhNYPS",
		"Code:": "https://github.com/cooelf/UVR-NMT"
	},
	{
		"title": "Tranquil Clouds: Neural Networks for Learning Temporally Coherent Features in Point Clouds",
		"authors": "Lukas Prantl,Nuttapong Chentanez,Stefan Jeschke,Nils Thuerey",
		"emails": "lukas.prantl@tum.de, nuttapong26@gmail.com, jeschke@stefan-jeschke.com, nils.thuerey@tum.de",
		"TL;DR:": "We propose a generative neural network approach for temporally coherent point clouds.",
		"Abstract:": "Point clouds, as a form of Lagrangian representation, allow for powerful and flexible applications in a large number of computational disciplines. We propose a novel deep-learning method to learn stable and temporally coherent feature spaces for points clouds that change over time. We identify a set of inherent problems with these approaches: without knowledge of the time dimension, the inferred solutions can exhibit strong flickering, and easy solutions to suppress this flickering can result in undesirable local minima that manifest themselves as halo structures. We propose a novel temporal loss function that takes into account higher time derivatives of the point positions, and encourages mingling, i.e., to prevent the aforementioned halos. We combine these techniques in a super-resolution method with a truncation approach to flexibly adapt the size of the generated positions. We show that our method works for large, deforming point sets from different sources to demonstrate the flexibility of our approach.",
		"Keywords:": "point clouds, spatio-temporal representations, Lagrangian data, temporal coherence, super-resolution, denoising",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BJeKh3VYDH",
		"pdf_link": "https://openreview.net/pdf?id=BJeKh3VYDH",
		"Code:": "https://github.com/cooelf/UVR-NMT"
	},
	{
		"title": "PC-DARTS: Partial Channel Connections for Memory-Efficient Architecture Search",
		"authors": "Yuhui Xu,Lingxi Xie,Xiaopeng Zhang,Xin Chen,Guo-Jun Qi,Qi Tian,Hongkai Xiong",
		"emails": "yuhuixu@sjtu.edu.cn, 198808xc@gmail.com, zxphistory@gmail.com, 1410452@tongji.edu.cn, guojunq@gmail.com, tian.qi1@huawei.com, xionghongkai@sjtu.edu.cn",
		"TL;DR:": "Allowing partial channel connection in super-networks to regularize and accelerate differentiable architecture search",
		"Abstract:": "Differentiable architecture search (DARTS) provided a fast solution in finding effective network architectures, but suffered from large memory and computing overheads in jointly training a super-net and searching for an optimal architecture. In this paper, we present a novel approach, namely  Partially-Connected DARTS, by sampling a small part of super-net to reduce the redundancy in exploring the network space, thereby performing a more efficient search without comprising the performance. In particular, we perform operation search in a subset of channels while bypassing the held out part in a shortcut. This strategy may suffer from an undesired inconsistency on selecting the edges of super-net caused by sampling different channels. We solve it by introducing  edge normalization, which adds a new set of edge-level hyper-parameters to reduce uncertainty in search. Thanks to the reduced memory cost, PC-DARTS can be trained with a larger batch size and, consequently, enjoy both faster speed and higher training stability. Experiment results demonstrate the effectiveness of the proposed method. Specifically, we achieve an error rate of 2.57% on CIFAR10 within merely 0.1 GPU-days for architecture search, and a state-of-the-art top-1 error rate of 24.2% on ImageNet (under the mobile setting) within 3.8 GPU-days for search. Our code has been made available athttps://www.dropbox.com/sh/on9lg3rpx1r6dkf/AABG5mt0sMHjnEJyoRnLEYW4a?dl=0.",
		"Keywords:": "Neural Architecture Search, DARTS, Regularization, Normalization",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BJlS634tPr",
		"pdf_link": "https://openreview.net/pdf?id=BJlS634tPr",
		"Code:": "https://www.dropbox.com/sh/on9lg3rpx1r6dkf/AABG5mt0sMHjnEJyoRnLEYW4a?dl=0"
	},
	{
		"title": "Online and stochastic optimization beyond Lipschitz continuity: A Riemannian approach",
		"authors": "Kimon Antonakopoulos,E. Veronica Belmega,Panayotis Mertikopoulos",
		"emails": "kimon.antonakopoulos@inria.fr, veronica.belmega@ensea.fr, panayotis.mertikopoulos@imag.fr",
		"TL;DR:": "We introduce a novel version of Lipschitz objective continuity that allows stochastic mirror descent methodologies to achieve optimal convergence rates in problems with singularities.",
		"Abstract:": "Motivated by applications to machine learning and imaging science, we study a class of online and stochastic optimization problems with loss functions that are not Lipschitz continuous; in particular, the loss functions encountered by the optimizer could exhibit gradient singularities or be singular themselves. Drawing on tools and techniques from Riemannian geometry, we examine a Riemann–Lipschitz (RL) continuity condition which is tailored to the singularity landscape of the problem’s loss functions. In this way, we are able to tackle cases beyond the Lipschitz framework provided by a global norm, and we derive optimal regret bounds and last iterate convergence results through the use of regularized learning methods (such as online mirror descent). These results are subsequently validated in a class of stochastic Poisson inverse problems that arise in imaging science.",
		"Keywords:": "Online optimization, stochastic optimization, Poisson inverse problems",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rkxZyaNtwB",
		"pdf_link": "https://openreview.net/pdf?id=rkxZyaNtwB",
		"Code:": "https://www.dropbox.com/sh/on9lg3rpx1r6dkf/AABG5mt0sMHjnEJyoRnLEYW4a?dl=0"
	},
	{
		"title": "Enhancing Adversarial Defense by k-Winners-Take-All",
		"authors": "Chang Xiao,Peilin Zhong,Changxi Zheng",
		"emails": "chang@cs.columbia.edu, pz2225@columbia.edu, cxz@cs.columbia.edu",
		"TL;DR:": "We propose a simple change to existing neural network structures for better defending against gradient-based adversarial attacks, using the k-winners-take-all activation function.",
		"Abstract:": "We propose a simple change to existing neural network structures for better defending against gradient-based adversarial attacks. Instead of using popular activation functions (such as ReLU), we advocate the use of k-Winners-Take-All (k-WTA) activation, a C0 discontinuous function that purposely invalidates the neural network model’s gradient at densely distributed input data points. The proposed k-WTA activation can be readily used in nearly all existing networks and training methods with no significant overhead. Our proposal is theoretically rationalized. We analyze why the discontinuities in k-WTA networks can largely prevent gradient-based search of adversarial examples and why they at the same time remain innocuous to the network training. This understanding is also empirically backed. We test k-WTA activation on various network structures optimized by a training method, be it adversarial training or not. In all cases, the robustness of k-WTA networks outperforms that of traditional networks under white-box attacks.",
		"Keywords:": "adversarial defense, activation function, winner takes all",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=Skgvy64tvr",
		"pdf_link": "https://openreview.net/pdf?id=Skgvy64tvr",
		"Code:": "https://github.com/a554b554/kWTA-Activation"
	},
	{
		"title": "Encoding word order in complex embeddings",
		"authors": "Benyou Wang,Donghao Zhao,Christina Lioma,Qiuchi Li,Peng Zhang,Jakob Grue Simonsen",
		"emails": "wang@dei.unipd.it, zhaodh@tju.edu.cn, chrh@di.ku.dk, qiuchili@dei.unipd.it, pzhang@tju.edu.cn, simonsen@di.ku.dk",
		"TL;DR:": "We propose a simple change to existing neural network structures for better defending against gradient-based adversarial attacks, using the k-winners-take-all activation function.",
		"Abstract:": "Sequential word order is important when processing text. Currently, neural networks (NNs) address this by modeling word position using position embeddings. The problem is that position embeddings capture the position of individual words, but not the ordered relationship (e.g., adjacency or precedence) between individual word positions. We present a novel and principled solution for modeling both the global absolute positions of words and their order relationships. Our solution generalizes word embeddings, previously defined as independent vectors, to continuous word functions over a variable (position). The benefit of continuous functions over variable positions is that word representations shift smoothly with increasing positions. Hence, word representations in different positions can correlate with each other in a continuous function. The general solution of these functions can be extended to complex-valued variants. We extend CNN, RNN and Transformer NNs to complex-valued versions to incorporate our complex embedding (we make all code available). Experiments on text classification, machine translation and language modeling show gains over both classical word embeddings and position-enriched word embeddings. To our knowledge, this is the first work in NLP to link imaginary numbers in complex-valued representations to concrete meanings (i.e., word order).",
		"Keywords:": "word embedding, complex-valued neural network, position embedding",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=Hke-WTVtwr",
		"pdf_link": "https://openreview.net/pdf?id=Hke-WTVtwr",
		"Code:": "https://github.com/iclr-complex-order/complex-order"
	},
	{
		"title": "DDSP: Differentiable Digital Signal Processing",
		"authors": "Jesse Engel,Lamtharn (Hanoi) Hantrakul,Chenjie Gu,Adam Roberts",
		"emails": "jesseengel@google.com, hanoih@google.com, gcj@google.com, adarob@google.com",
		"TL;DR:": "Better audio synthesis by combining interpretable DSP with end-to-end learning.",
		"Abstract:": "Most generative models of audio directly generate samples in one of two domains: time or frequency. While sufficient to express any signal, these representations are inefficient, as they do not utilize existing knowledge of how sound is generated and perceived. A third approach (vocoders/synthesizers) successfully incorporates strong domain knowledge of signal processing and perception, but has been less actively researched due to limited expressivity and difficulty integrating with modern auto-differentiation-based machine learning methods. In this paper, we introduce the Differentiable Digital Signal Processing (DDSP) library, which enables direct integration of classic signal processing elements with deep learning methods. Focusing on audio synthesis, we achieve high-fidelity generation without the need for large autoregressive models or adversarial losses, demonstrating that DDSP enables utilizing strong inductive biases without losing the expressive power of neural networks. Further, we show that combining interpretable modules permits manipulation of each separate model component, with applications such as independent control of pitch and loudness, realistic extrapolation to pitches not seen during training, blind dereverberation of room acoustics, transfer of extracted room acoustics to new environments, and transformation of timbre between disparate sources. In short, DDSP enables an interpretable and modular approach to generative modeling, without sacrificing the benefits of deep learning. The library will is available athttps://github.com/magenta/ddspand we encourage further contributions from the community and domain experts.",
		"Keywords:": "dsp, audio, music, nsynth, wavenet, wavernn, vocoder, synthesizer, sound, signal, processing, tensorflow, autoencoder, disentanglement",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=B1x1ma4tDr",
		"pdf_link": "https://openreview.net/pdf?id=B1x1ma4tDr",
		"Code:": "https://github.com/magenta/ddsp"
	},
	{
		"title": "Cross-Domain Few-Shot Classification via Learned Feature-Wise Transformation",
		"authors": "Hung-Yu Tseng,Hsin-Ying Lee,Jia-Bin Huang,Ming-Hsuan Yang",
		"emails": "htseng6@ucmerced.edu, hlee246@ucmerced.edu, jbhuang@vt.edu, mhyang@ucmerced.edu",
		"TL;DR:": "Better audio synthesis by combining interpretable DSP with end-to-end learning.",
		"Abstract:": "Few-shot classification aims to recognize novel categories with only few labeled images in each class. Existing metric-based few-shot classification algorithms predict categories by comparing the feature embeddings of query images with those from a few labeled images (support examples) using a learned metric function. While promising performance has been demonstrated, these methods often fail to generalize to unseen domains due to large discrepancy of the feature distribution across domains. In this work, we address the problem of few-shot classification under domain shifts for metric-based methods. Our core idea is to use feature-wise transformation layers for augmenting the image features using affine transforms to simulate various feature distributions under different domains in the training stage. To capture variations of the feature distributions under different domains, we further apply a learning-to-learn approach to search for the hyper-parameters of the feature-wise transformation layers. We conduct extensive experiments and ablation studies under the domain generalization setting using five few-shot classification datasets: mini-ImageNet, CUB, Cars, Places, and Plantae. Experimental results demonstrate that the proposed feature-wise transformation layer is applicable to various metric-based models, and provides consistent improvements on the few-shot classification performance under domain shift.",
		"Keywords:": "dsp, audio, music, nsynth, wavenet, wavernn, vocoder, synthesizer, sound, signal, processing, tensorflow, autoencoder, disentanglement",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=SJl5Np4tPr",
		"pdf_link": "https://openreview.net/pdf?id=SJl5Np4tPr",
		"Code:": "https://github.com/magenta/ddsp"
	},
	{
		"title": "Ridge Regression: Structure, Cross-Validation, and Sketching",
		"authors": "Sifan Liu,Edgar Dobriban",
		"emails": "sfliu@stanford.edu, dobribanedgar@gmail.com",
		"TL;DR:": "We study the structure of ridge regression in a high-dimensional asymptotic framework, and get insights about cross-validation and sketching.",
		"Abstract:": "We study the following three fundamental problems about ridge regression: (1) what is the structure of the estimator? (2) how to correctly use cross-validation to choose the regularization parameter? and (3) how to accelerate computation without losing too much accuracy? We consider the three problems in a unified large-data linear model. We give a precise representation of ridge regression as a covariance matrix-dependent linear combination of the true parameter and the noise. \n      We study the bias of $K$-fold cross-validation for choosing the regularization parameter, and propose a simple bias-correction. We analyze the accuracy of primal and dual sketching for ridge regression, showing they are surprisingly accurate. Our results are illustrated by simulations and by analyzing empirical data.",
		"Keywords:": "ridge regression, sketching, random matrix theory, cross-validation, high-dimensional asymptotics",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=HklRwaEKwB",
		"pdf_link": "https://openreview.net/pdf?id=HklRwaEKwB",
		"Code:": "https://github.com/liusf15/RidgeRegression"
	},
	{
		"title": "Finite Depth and Width Corrections to the Neural Tangent Kernel",
		"authors": "Boris Hanin,Mihai Nica",
		"emails": "bhanin@math.tamu.edu, mnica@math.utoronto.ca",
		"TL;DR:": "The neural tangent kernel in a randomly initialized ReLU net is non-trivial fluctuations as long as the depth and width are comparable.",
		"Abstract:": "We prove the precise scaling, at finite depth and width, for the mean and variance of the neural tangent kernel (NTK) in a randomly initialized ReLU network. The standard deviation is exponential in the ratio of network depth to width. Thus, even in the limit of infinite overparameterization, the NTK is not deterministic if depth and width simultaneously tend to infinity. Moreover, we prove that for such deep and wide networks, the NTK has a non-trivial evolution during training by showing that the mean of its first SGD update is also exponential in the ratio of network depth to width. This is sharp contrast to the regime where depth is fixed and network width is very large. Our results suggest that, unlike relatively shallow and wide networks, deep and wide ReLU networks are capable of learning data-dependent features even in the so-called lazy training regime.",
		"Keywords:": "Neural Tangent Kernel, Finite Width Corrections, Random ReLU Net, Wide Networks, Deep Networks",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=SJgndT4KwB",
		"pdf_link": "https://openreview.net/pdf?id=SJgndT4KwB",
		"Code:": "https://github.com/liusf15/RidgeRegression"
	},
	{
		"title": "Meta-Learning without Memorization",
		"authors": "Mingzhang Yin,George Tucker,Mingyuan Zhou,Sergey Levine,Chelsea Finn",
		"emails": "mzyin@utexas.edu, gjt@google.com, mingyuan.zhou@mccombs.utexas.edu, svlevine@eecs.berkeley.edu, cbfinn@cs.stanford.edu",
		"TL;DR:": "We identify and formalize the memorization problem in meta-learning and solve this problem with novel meta-regularization method, which greatly expand the domain that meta-learning can be  applicable to and effective on.",
		"Abstract:": "The ability to learn new concepts with small amounts of data is a critical aspect of intelligence that has proven challenging for deep learning methods. Meta-learning has emerged as a promising technique for leveraging data from previous tasks to enable efficient learning of new tasks. However, most meta-learning algorithms implicitly require that the meta-training tasks be mutually-exclusive, such that no single model can solve all of the tasks at once. For example, when creating tasks for few-shot image classification, prior work uses a per-task random assignment of image classes to N-way classification labels. If this is not done, the meta-learner can ignore the task training data and learn a single model that performs all of the meta-training tasks zero-shot, but does not adapt effectively to new image classes.  This requirement means that the user must take great care in designing the tasks, for example by shuffling labels or removing task identifying information from the inputs. In some domains, this makes meta-learning entirely inapplicable. In this paper, we address this challenge by designing a meta-regularization objective using information theory that places precedence on data-driven adaptation. This causes the meta-learner to decide what must be learned from the task training data and what should be inferred from the task testing input. By doing so, our algorithm can successfully use data from non-mutually-exclusive tasks to efficiently adapt to novel tasks. We demonstrate its applicability to both contextual and gradient-based meta-learning algorithms, and apply it in practical settings where applying standard meta-learning has been difficult. Our approach substantially outperforms standard meta-learning algorithms in these settings.",
		"Keywords:": "meta-learning, memorization, regularization, overfitting, mutually-exclusive",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BklEFpEYwS",
		"pdf_link": "https://openreview.net/pdf?id=BklEFpEYwS",
		"Code:": "https://github.com/google-research/google-research/tree/master/meta_learning_without_memorization"
	},
	{
		"title": "Influence-Based Multi-Agent Exploration",
		"authors": "Tonghan Wang*,Jianhao Wang*,Yi Wu,Chongjie Zhang",
		"emails": "tonghanwang1996@gmail.com, 1040594377@qq.com, jxwuyi@openai.com, chongjie@tsinghua.edu.cn",
		"TL;DR:": "We identify and formalize the memorization problem in meta-learning and solve this problem with novel meta-regularization method, which greatly expand the domain that meta-learning can be  applicable to and effective on.",
		"Abstract:": "Intrinsically motivated reinforcement learning aims to address the exploration challenge for sparse-reward tasks. However, the study of exploration methods in transition-dependent multi-agent settings is largely absent from the literature. We aim to take a step towards solving this problem. We present two exploration methods: exploration via information-theoretic influence (EITI) and exploration via decision-theoretic influence (EDTI), by exploiting the role of interaction in coordinated behaviors of agents. EITI uses mutual information to capture the interdependence between the transition dynamics of agents. EDTI uses a novel intrinsic reward, called Value of Interaction (VoI), to characterize and quantify the influence of one agent's behavior on expected returns of other agents. By optimizing EITI or EDTI objective as a regularizer, agents are encouraged to coordinate their exploration and learn policies to optimize the team performance. We show how to optimize these regularizers so that they can be easily integrated with policy gradient reinforcement learning. The resulting update rule draws a connection between coordinated exploration and intrinsic reward distribution. Finally, we empirically demonstrate the significant strength of our methods in a variety of multi-agent scenarios.",
		"Keywords:": "Multi-agent reinforcement learning, Exploration",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BJgy96EYvr",
		"pdf_link": "https://openreview.net/pdf?id=BJgy96EYvr",
		"Code:": "https://github.com/TonghanWang/EITI-EDTI"
	},
	{
		"title": "HOPPITY: LEARNING GRAPH TRANSFORMATIONS TO DETECT AND FIX BUGS IN PROGRAMS",
		"authors": "Elizabeth Dinella,Hanjun Dai,Ziyang Li,Mayur Naik,Le Song,Ke Wang",
		"emails": "edinella@seas.upenn.edu, hadai@google.com, liby99@seas.upenn.edu, mhnaik@cis.upenn.edu, lsong@cc.gatech.edu, kewang@visa.com",
		"TL;DR:": "An learning-based approach for detecting and fixing bugs in Javascript",
		"Abstract:": "We present a learning-based approach to detect and fix a broad range of bugs in Javascript programs. We frame the problem in terms of learning a sequence of graph transformations: given a buggy program modeled by a graph structure, our model makes a sequence of predictions including the position of bug nodes and corresponding graph edits to produce a fix. Unlike previous works that use deep neural networks, our approach targets bugs that are more complex and semantic in nature (i.e.~bugs that require adding or deleting statements to fix). We have realized our approach in a tool called HOPPITY. By training on 290,715 Javascript code change commits on Github, HOPPITY correctly detects and fixes bugs in 9,490 out of 36,361 programs in an end-to-end fashion. Given the bug location and type of the fix, HOPPITY also outperforms the baseline approach by a wide margin.",
		"Keywords:": "Bug Detection, Program Repair, Graph Neural Network, Graph Transformation",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=SJeqs6EFvB",
		"pdf_link": "https://openreview.net/pdf?id=SJeqs6EFvB",
		"Code:": "https://github.com/TonghanWang/EITI-EDTI"
	},
	{
		"title": "Sliced Cramer Synaptic Consolidation for Preserving Deeply Learned Representations",
		"authors": "Soheil Kolouri,Nicholas A. Ketz,Andrea Soltoggio,Praveen K. Pilly",
		"emails": "skolouri@hrl.com, naketz@hrl.com, a.soltoggio@lboro.ac.uk, pkpilly@hrl.com",
		"TL;DR:": "\"A novel framework for overcoming catastrophic forgetting by preserving the distribution of the network's output at an arbitrary layer.\"",
		"Abstract:": "Deep neural networks suffer from the inability to preserve the learned data representation (i.e., catastrophic forgetting) in domains where the input data distribution is non-stationary, and it changes during training.  Various selective synaptic plasticity approaches have been recently proposed to preserve network parameters, which are crucial for previously learned tasks while learning new tasks. We explore such selective synaptic plasticity approaches through a unifying lens of memory replay and show the close relationship between methods like Elastic Weight Consolidation (EWC) and Memory-Aware-Synapses (MAS).  We then propose a fundamentally different class of preservation methods that aim at preserving the distribution of internal neural representations for previous tasks while learning a new one. We propose the sliced Cram\\'{e}r distance as a suitable choice for such preservation and evaluate our Sliced Cramer Preservation (SCP) algorithm through extensive empirical investigations on various network architectures in both supervised and unsupervised learning settings. We show that SCP consistently utilizes the learning capacity of the network better than online-EWC and MAS methods on various incremental learning tasks.",
		"Keywords:": "selective plasticity, catastrophic forgetting, intransigence",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BJge3TNKwH",
		"pdf_link": "https://openreview.net/pdf?id=BJge3TNKwH",
		"Code:": "https://github.com/TonghanWang/EITI-EDTI"
	},
	{
		"title": "How much Position Information Do Convolutional Neural Networks Encode?",
		"authors": "Md Amirul Islam*,Sen Jia*,Neil D. B. Bruce",
		"emails": "amirul@scs.ryerson.ca, sen.jia@ryerson.ca, bruce@ryerson.ca",
		"TL;DR:": "Our work shows positional information has been implicitly encoded in a network. This information is important for detecting position-dependent features, e.g. semantic and saliency.",
		"Abstract:": "In contrast to fully connected networks, Convolutional Neural Networks (CNNs) achieve efficiency by learning weights associated with local filters with a finite spatial extent. An implication of this is that a filter may know what it is looking at, but not where it is positioned in the image. Information concerning absolute position is inherently useful, and it is reasonable to assume that deep CNNs may implicitly learn to encode this information if there is a means to do so. In this paper, we test this hypothesis revealing the surprising degree of absolute position information that is encoded in commonly used neural networks. A comprehensive set of experiments show the validity of this hypothesis and shed light on how and where this information is represented while offering clues to where positional information is derived from in deep CNNs.",
		"Keywords:": "network understanding, absolute position information",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rJeB36NKvB",
		"pdf_link": "https://openreview.net/pdf?id=rJeB36NKvB",
		"Code:": "https://github.com/TonghanWang/EITI-EDTI"
	},
	{
		"title": "Hamiltonian Generative Networks",
		"authors": "Aleksandar Botev,Irina Higgins,Andrew Jaegle,Sebastian Racaniere,Danilo J. Rezende,Peter Toth",
		"emails": "botev@google.com, irinah@google.com, drewjaegle@google.com, sracaniere@google.com, danilor@google.com, petertoth@google.com",
		"TL;DR:": "We introduce a class of generative models that reliably learn Hamiltonian dynamics from high-dimensional observations. The learnt Hamiltonian can be applied to sequence modeling or as a normalising flow.",
		"Abstract:": "The Hamiltonian formalism plays a central role in classical and quantum physics. Hamiltonians are the main tool for modelling the continuous time evolution of systems with conserved quantities, and they come equipped with many useful properties, like time reversibility and smooth interpolation in time. These properties are important for many machine learning problems - from sequence prediction to reinforcement learning and density modelling - but are not typically provided out of the box by standard tools such as recurrent neural networks. In this paper, we introduce the Hamiltonian Generative Network (HGN), the first approach capable of consistently learning Hamiltonian dynamics from high-dimensional observations (such as images) without restrictive domain assumptions. Once trained, we can use HGN to sample new trajectories, perform rollouts both forward and backward in time, and even speed up or slow down the learned dynamics. We demonstrate how a simple modification of the network architecture turns HGN into a powerful normalising flow model, called Neural Hamiltonian Flow (NHF), that uses Hamiltonian dynamics to model expressive densities. Hence, we hope that our work serves as a first practical demonstration of the value that the Hamiltonian formalism can bring to machine learning. More results and video evaluations are available at:http://tiny.cc/hgn",
		"Keywords:": "Hamiltonian dynamics, normalising flows, generative model, physics",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=HJenn6VFvB",
		"pdf_link": "https://openreview.net/pdf?id=HJenn6VFvB",
		"Code:": "https://github.com/TonghanWang/EITI-EDTI"
	},
	{
		"title": "CoPhy: Counterfactual Learning of Physical Dynamics",
		"authors": "Fabien Baradel,Natalia Neverova,Julien Mille,Greg Mori,Christian Wolf",
		"emails": "fabien.baradel@insa-lyon.fr, nneverova@fb.com, julien.mille@insa-cvl.fr, mori@cs.sfu.ca, christian.wolf@insa-lyon.fr",
		"TL;DR:": "We introduce a class of generative models that reliably learn Hamiltonian dynamics from high-dimensional observations. The learnt Hamiltonian can be applied to sequence modeling or as a normalising flow.",
		"Abstract:": "Understanding causes and effects in mechanical systems is an essential component of reasoning in the physical world. This work poses a new problem of counterfactual learning of object mechanics from visual input.  We develop the CoPhy benchmark to assess the capacity of the state-of-the-art models for causal physical reasoning in a synthetic 3D environment and propose a model for learning the physical dynamics in a counterfactual setting. Having observed a mechanical experiment that involves, for example, a falling tower of blocks, a set of bouncing balls or colliding objects, we learn to predict how its outcome is affected by an arbitrary intervention on its initial conditions, such as displacing one of the objects in the scene. The alternative future is predicted given the altered past and a latent representation of the confounders learned by the model in an end-to-end fashion with no supervision. We compare against feedforward video prediction baselines and show how observing alternative experiences allows the network to capture latent physical properties of the environment, which results in significantly more accurate predictions at the level of super human performance.",
		"Keywords:": "intuitive physics, visual reasoning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=SkeyppEFvS",
		"pdf_link": "https://openreview.net/pdf?id=SkeyppEFvS",
		"Code:": "https://github.com/fabienbaradel/cophy"
	},
	{
		"title": "Estimating counterfactual treatment outcomes over time through adversarially balanced representations",
		"authors": "Ioana Bica,Ahmed M Alaa,James Jordon,Mihaela van der Schaar",
		"emails": "ioana.bica@eng.ox.ac.uk, a7med3laa@hotmail.com, james.jordon@wolfson.ox.ac.uk, mschaar@turing.ac.uk",
		"TL;DR:": "We introduce a class of generative models that reliably learn Hamiltonian dynamics from high-dimensional observations. The learnt Hamiltonian can be applied to sequence modeling or as a normalising flow.",
		"Abstract:": "Identifying when to give treatments to patients and how to select among multiple treatments over time are important medical problems with a few existing solutions. In this paper, we introduce the Counterfactual Recurrent Network (CRN), a novel sequence-to-sequence model that leverages the increasingly available patient observational data to estimate treatment effects over time and answer such medical questions. To handle the bias from time-varying confounders, covariates affecting the treatment assignment policy in the observational data, CRN uses domain adversarial training to build balancing representations of the patient history. At each timestep, CRN constructs a treatment invariant representation which removes the association between patient history and treatment assignments and thus can be reliably used for making counterfactual predictions. On a simulated model of tumour growth, with varying degree of time-dependent confounding, we show how our model achieves lower error in estimating counterfactuals and in choosing the correct treatment and timing of treatment than current state-of-the-art methods.",
		"Keywords:": "treatment effects over time, causal inference, counterfactual estimation",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BJg866NFvB",
		"pdf_link": "https://openreview.net/pdf?id=BJg866NFvB",
		"Code:": "https://github.com/fabienbaradel/cophy"
	},
	{
		"title": "Gradientless Descent: High-Dimensional Zeroth-Order Optimization",
		"authors": "Daniel Golovin,John Karro,Greg Kochanski,Chansoo Lee,Xingyou Song,Qiuyi Zhang",
		"emails": "dgg@google.com, karro@google.com, gpk@google.com, chansoo@google.com, xingyousong@google.com, qiuyiz@google.com",
		"TL;DR:": "Gradientless Descent is a provably efficient gradient-free algorithm that is monotone-invariant and fast for high-dimensional zero-th order optimization.",
		"Abstract:": "Zeroth-order optimization is the process of minimizing an objective $f(x)$, given oracle access to evaluations at adaptively chosen inputs $x$. In this paper, we present two simple yet powerful GradientLess Descent (GLD) algorithms that do not rely on an underlying gradient estimate and are numerically stable. We analyze our algorithm from a novel geometric perspective and we show that for {\\it any monotone transform} of a smooth and strongly convex objective with latent dimension $k \\ge n$, we present a novel analysis that shows convergence within an $\\epsilon$-ball of the optimum in $O(kQ\\log(n)\\log(R/\\epsilon))$ evaluations, where the input dimension is $n$, $R$ is the diameter of the input space and $Q$ is the condition number. Our rates are the first of its kind to be both 1) poly-logarithmically dependent on dimensionality and 2) invariant under monotone transformations. We further leverage our geometric perspective to show that our analysis is optimal. Both monotone invariance and its ability to utilize a low latent dimensionality are key to the empirical success of our algorithms, as demonstrated on synthetic and MuJoCo benchmarks.",
		"Keywords:": "Zeroth Order Optimization",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=Skep6TVYDB",
		"pdf_link": "https://openreview.net/pdf?id=Skep6TVYDB",
		"Code:": "https://github.com/fabienbaradel/cophy"
	},
	{
		"title": "Conditional Learning of Fair Representations",
		"authors": "Han Zhao,Amanda Coston,Tameem Adel,Geoffrey J. Gordon",
		"emails": "han.zhao@cs.cmu.edu, acoston@cs.cmu.edu, tah47@cam.ac.uk, ggordon@cs.cmu.edu",
		"TL;DR:": "We propose a novel algorithm for learning fair representations that can simultaneously mitigate two notions of disparity among different demographic subgroups.",
		"Abstract:": "We propose a novel algorithm for learning fair representations that can simultaneously mitigate two notions of disparity among different demographic subgroups in the classification setting. Two key components underpinning the design of our algorithm are balanced error rate and conditional alignment of representations. We show how these two components contribute to ensuring accuracy parity and equalized false-positive and false-negative rates across groups without impacting demographic parity. Furthermore, we also demonstrate both in theory and on two real-world experiments that the proposed algorithm leads to a better utility-fairness trade-off on balanced datasets compared with existing algorithms on learning fair representations for classification.",
		"Keywords:": "algorithmic fairness, representation learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=Hkekl0NFPr",
		"pdf_link": "https://openreview.net/pdf?id=Hkekl0NFPr",
		"Code:": "https://github.com/fabienbaradel/cophy"
	},
	{
		"title": "Inductive Matrix Completion Based on Graph Neural Networks",
		"authors": "Muhan Zhang,Yixin Chen",
		"emails": "muhan@wustl.edu, chen@cse.wustl.edu",
		"TL;DR:": "We propose a novel algorithm for learning fair representations that can simultaneously mitigate two notions of disparity among different demographic subgroups.",
		"Abstract:": "We propose an inductive matrix completion model without using side information. By factorizing the (rating) matrix into the product of low-dimensional latent embeddings of rows (users) and columns (items), a majority of existing matrix completion methods are transductive, since the learned embeddings cannot generalize to unseen rows/columns or to new matrices. To make matrix completion inductive, most previous works use content (side information), such as user's age or movie's genre, to make predictions. However, high-quality content is not always available, and can be hard to extract. Under the extreme setting where not any side information is available other than the matrix to complete, can we still learn an inductive matrix completion model? In this paper, we propose an Inductive Graph-based Matrix Completion (IGMC) model to address this problem. IGMC trains a graph neural network (GNN) based purely on 1-hop subgraphs around (user, item) pairs generated from the rating matrix and maps these subgraphs to their corresponding ratings. It achieves highly competitive performance with state-of-the-art transductive baselines. In addition, IGMC is inductive -- it can generalize to users/items unseen during the training (given that their interactions exist), and can even transfer to new tasks. Our transfer learning experiments show that a model trained out of the MovieLens dataset can be directly used to predict Douban movie ratings with surprisingly good performance. Our work demonstrates that: 1) it is possible to train inductive matrix completion models without using side information while achieving similar or better performances than state-of-the-art transductive methods; 2) local graph patterns around a (user, item) pair are effective predictors of the rating this user gives to the item; and 3) Long-range dependencies might not be necessary for modeling recommender systems.",
		"Keywords:": "matrix completion, graph neural network",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=ByxxgCEYDS",
		"pdf_link": "https://openreview.net/pdf?id=ByxxgCEYDS",
		"Code:": "https://github.com/muhanzhang/IGMC"
	},
	{
		"title": "Duration-of-Stay Storage Assignment under Uncertainty",
		"authors": "Michael Lingzhi Li,Elliott Wolf,Daniel Wintz",
		"emails": "mlli@mit.edu, ewolf@lineagelogistics.com, dwintz@lineagelogistics.com",
		"TL;DR:": "We develop a new storage assignment framework with a novel neural network that enables large efficiency gains in the warehouse.",
		"Abstract:": "Storage assignment, the act of choosing what goods are placed in what locations in a warehouse, is a central problem of supply chain logistics. Past literature has shown that the optimal method to assign pallets is to arrange them in increasing duration of stay in the warehouse (the Duration-of-Stay, or DoS, method), but the methodology requires perfect prior knowledge of DoS for each pallet, which is unknown and uncertain under realistic conditions. Attempts to predict DoS have largely been unfruitful due to the multi-valuedness nature (every shipment contains multiple identical pallets with different DoS) and data sparsity induced by lack of matching historical conditions. In this paper, we introduce a new framework for storage assignment that provides a solution to the DoS prediction problem through a distributional reformulation and a novel neural network, ParallelNet. Through collaboration with a world-leading cold storage company, we show that the system is able to predict DoS with a MAPE of 29%, a decrease of ~30% compared to a CNN-LSTM model, and suffers less performance decay into the future. The framework is then integrated into a first-of-its-kind Storage Assignment system, which is being deployed in warehouses across United States, with initial results showing up to 21% in labor savings. We also release the first publicly available set of warehousing records to facilitate research into this central problem.",
		"Keywords:": "Storage Assignment, Deep Learning, Duration-of-Stay, Application, Natural Language Processing, Parallel Network",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=Hkx7xRVYDr",
		"pdf_link": "https://openreview.net/pdf?id=Hkx7xRVYDr",
		"Code:": "https://anonymous.4open.science/r/8de2111c-d496-423e-86f3-b5e31792bead/"
	},
	{
		"title": "Emergence of functional and structural properties of the head direction system by optimization of recurrent neural networks",
		"authors": "Christopher J. Cueva,Peter Y. Wang,Matthew Chin,Xue-Xin Wei",
		"emails": "ccueva@gmail.com, peterwang724@gmail.com, mattchin35@gmail.com, weixxpku@gmail.com",
		"TL;DR:": "Artificial neural networks trained with gradient descent are capable of recapitulating both realistic neural activity and the anatomical organization of a biological circuit.",
		"Abstract:": "Recent work suggests goal-driven training of neural networks can be used to model neural activity in the brain. While response properties of neurons in artificial neural networks bear similarities to those in the brain, the network architectures are often constrained to be different. Here we ask if a neural network can recover both neural representations and, if the architecture is unconstrained and optimized, also the anatomical properties of neural circuits. We demonstrate this in a system where the connectivity and the functional organization have been characterized, namely, the head direction circuit of the rodent and fruit fly. We trained recurrent neural networks (RNNs) to estimate head direction through integration of angular velocity. We found that the two distinct classes of neurons observed in the head direction system, the Compass neurons and the Shifter neurons, emerged naturally in artificial neural networks as a result of training. Furthermore, connectivity analysis and in-silico neurophysiology revealed structural and mechanistic similarities between artificial networks and the head direction system. Overall, our results show that optimization of RNNs in a goal-driven task can recapitulate the structure and function of biological circuits, suggesting that artificial neural networks can be used to study the brain at the level of both neural activity and anatomical organization.",
		"Keywords:": "recurrent network, head direction system, neural circuits, neural coding",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=HklSeREtPB",
		"pdf_link": "https://openreview.net/pdf?id=HklSeREtPB",
		"Code:": "https://anonymous.4open.science/r/8de2111c-d496-423e-86f3-b5e31792bead/"
	},
	{
		"title": "Deep neuroethology of a virtual rodent",
		"authors": "Josh Merel,Diego Aldarondo,Jesse Marshall,Yuval Tassa,Greg Wayne,Bence Olveczky",
		"emails": "jsmerel@google.com, diegoaldarondo@g.harvard.edu, jesse_d_marshall@fas.harvard.edu, tassa@google.com, gregwayne@google.com, olveczky@fas.harvard.edu",
		"TL;DR:": "We built a physical simulation of a rodent, trained it to solve a set of tasks, and analyzed the resulting networks.",
		"Abstract:": "Parallel developments in neuroscience and deep learning have led to mutually productive exchanges, pushing our understanding of real and artificial neural networks in sensory and cognitive systems. However, this interaction between fields is less developed in the study of motor control. In this work, we develop a virtual rodent as a platform for the grounded study of motor activity in artificial models of embodied control. We then use this platform to study motor activity across contexts by training a model to solve four complex tasks. Using methods familiar to neuroscientists, we describe the behavioral representations and algorithms employed by different layers of the network using a neuroethological approach to characterize motor activity relative to the rodent's behavior and goals. We find that the model uses two classes of representations which respectively encode the task-specific behavioral strategies and task-invariant behavioral kinematics. These representations are reflected in the sequential activity and population dynamics of neural subpopulations. Overall, the virtual rodent facilitates grounded collaborations between deep reinforcement learning and motor neuroscience.",
		"Keywords:": "computational neuroscience, motor control, deep RL",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=SyxrxR4KPS",
		"pdf_link": "https://openreview.net/pdf?id=SyxrxR4KPS",
		"Code:": "https://anonymous.4open.science/r/8de2111c-d496-423e-86f3-b5e31792bead/"
	},
	{
		"title": "Doubly Robust Bias Reduction in Infinite Horizon Off-Policy Estimation",
		"authors": "Ziyang Tang*,Yihao Feng*,Lihong Li,Dengyong Zhou,Qiang Liu",
		"emails": "ztang@cs.utexas.edu, yihao@cs.utexas.edu, lihongli.cs@gmail.com, dennyzhou@google.com, lqiang@cs.utexas.edu",
		"TL;DR:": "We develop a new doubly robust estimator based on the infinite horizon density ratio and off policy value estimation.",
		"Abstract:": "Infinite horizon off-policy policy evaluation is a highly challenging task due to the excessively large variance of typical importance sampling (IS) estimators. Recently, Liu et al. (2018) proposed an approach that significantly reduces the variance of infinite-horizon off-policy evaluation by estimating the stationary density ratio, but at the cost of introducing potentially high risks due to the error in density ratio estimation. In this paper, we develop a bias-reduced augmentation of their method, which can take advantage of a learned value function to obtain higher accuracy. Our method is doubly robust in that the bias vanishes when either the density ratio or value function estimation is perfect.  In general, when either of them is accurate, the bias can also be reduced. Both theoretical and empirical results show that our method yields significant advantages over previous methods.",
		"Keywords:": "off-policy evaluation, infinite horizon, doubly robust, reinforcement learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=S1glGANtDr",
		"pdf_link": "https://openreview.net/pdf?id=S1glGANtDr",
		"Code:": "https://anonymous.4open.science/r/8de2111c-d496-423e-86f3-b5e31792bead/"
	},
	{
		"title": "Learning Compositional Koopman Operators for Model-Based Control",
		"authors": "Yunzhu Li,Hao He,Jiajun Wu,Dina Katabi,Antonio Torralba",
		"emails": "liyunzhu@mit.edu, haohe@mit.edu, jiajunwu.cs@gmail.com, dina@csail.mit.edu, torralba@csail.mit.edu",
		"TL;DR:": "Learning compositional Koopman operators for efficient system identification and model-based control.",
		"Abstract:": "Finding an embedding space for a linear approximation of a nonlinear dynamical system enables efficient system identification and control synthesis. The Koopman operator theory lays the foundation for identifying the nonlinear-to-linear coordinate transformations with data-driven methods. Recently, researchers have proposed to use deep neural networks as a more expressive class of basis functions for calculating the Koopman operators. These approaches, however, assume a fixed dimensional state space; they are therefore not applicable to scenarios with a variable number of objects. In this paper, we propose to learn compositional Koopman operators, using graph neural networks to encode the state into object-centric embeddings and using a block-wise linear transition matrix to regularize the shared structure across objects. The learned dynamics can quickly adapt to new environments of unknown physical parameters and produce control signals to achieve a specified goal. Our experiments on manipulating ropes and controlling soft robots show that the proposed method has better efficiency and generalization ability than existing baselines.",
		"Keywords:": "Koopman operators, graph neural networks, compositionality",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=H1ldzA4tPr",
		"pdf_link": "https://openreview.net/pdf?id=H1ldzA4tPr",
		"Code:": "https://anonymous.4open.science/r/8de2111c-d496-423e-86f3-b5e31792bead/"
	},
	{
		"title": "CLEVRER: Collision Events for Video Representation and Reasoning",
		"authors": "Kexin Yi*,Chuang Gan*,Yunzhu Li,Pushmeet Kohli,Jiajun Wu,Antonio Torralba,Joshua B. Tenenbaum",
		"emails": "kyi@g.harvard.edu, ganchuang1990@gmail.com, liyunzhu@mit.edu, pushmeet@google.com, jiajunwu@mit.edu, torralba@mit.edu, jbt@mit.edu",
		"TL;DR:": "We present a diagnostic dataset for systematic study of temporal and casual reasoning in videos.",
		"Abstract:": "The ability to reason about temporal and causal events from videos lies at the core of human intelligence. Most video reasoning benchmarks, however, focus on pattern recognition from complex visual and language input, instead of on causal structure. We study the complementary problem, exploring the temporal and causal structures behind videos of objects with simple visual appearance. To this end, we introduce the CoLlision Events for Video REpresentation and Reasoning (CLEVRER) dataset, a  diagnostic video dataset for systematic evaluation of computational models on a wide range of reasoning tasks.  Motivated by the theory of human casual judgment, CLEVRER includes four types of question:  descriptive (e.g., ‘what color’), explanatory (‘what’s responsible for’), predictive (‘what will happen next’), and counterfactual (‘what if’).  We evaluate various state-of-the-art models for visual reasoning on our benchmark. While these models thrive on the perception-based task (descriptive), they perform poorly on the causal tasks (explanatory, predictive and counterfactual), suggesting that a principled approach for causal reasoning should incorporate the capability of both perceiving complex visual and language inputs, and understanding the underlying dynamics and causal relations. We also study an oracle model that explicitly combines these components via symbolic representations.",
		"Keywords:": "Neuro-symbolic, Reasoning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=HkxYzANYDB",
		"pdf_link": "https://openreview.net/pdf?id=HkxYzANYDB",
		"Code:": "http://clevrer.csail.mit.edu/"
	},
	{
		"title": "The Logical Expressiveness of Graph Neural Networks",
		"authors": "Pablo Barceló,Egor V. Kostylev,Mikael Monet,Jorge Pérez,Juan Reutter,Juan Pablo Silva",
		"emails": "pbarcelo@gmail.com, egor.kostylev@cs.ox.ac.uk, mikael.monet@imfd.cl, jorge.perez.rojas@gmail.com, juan.reutter@gmail.com, jpsilvapena@gmail.com",
		"TL;DR:": "We characterize the expressive power of GNNs in terms of classical logical languages, separating different GNNs and showing connections with standard notions in Knowledge Representation.",
		"Abstract:": "The ability of graph neural networks (GNNs) for distinguishing nodes in graphs has been recently characterized in terms of the Weisfeiler-Lehman (WL) test for checking graph isomorphism. This characterization, however, does not settle the issue of which Boolean node classifiers (i.e., functions classifying nodes in graphs as true or  false) can be expressed by GNNs.  We tackle this problem by focusing on Boolean classifiers expressible as formulas in the logic FOC2, a well-studied fragment of first order logic. FOC2 is tightly related to the WL test, and hence to GNNs. We start by studying a popular class of GNNs, which we call AC-GNNs, in which the features of each node in the graph are updated, in successive layers, only in terms of the features of its neighbors.  We show that this class of GNNs is too weak to capture all FOC2 classifiers, and provide a syntactic characterization of  the largest subclass of FOC2 classifiers that can be captured by AC-GNNs. This subclass coincides with a logic heavily used by the knowledge representation community. We then look at what needs to be added to AC-GNNs for capturing all FOC2 classifiers. We show that it suffices to add readout functions, which allow to update the features of a node not only in terms of its neighbors, but also in terms of a global attribute vector. We call GNNs of this kind ACR-GNNs. We experimentally validate our findings showing that, on synthetic data conforming to FOC2 formulas, AC-GNNs struggle to fit the training data while ACR-GNNs can generalize even to graphs of sizes not seen during training.",
		"Keywords:": "Graph Neural Networks, First Order Logic, Expressiveness",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=r1lZ7AEKvB",
		"pdf_link": "https://openreview.net/pdf?id=r1lZ7AEKvB",
		"Code:": "https://anonymous.4open.science/r/787222e2-ad5e-4810-a788-e80f0fe7eff0/"
	},
	{
		"title": "The Break-Even Point on Optimization Trajectories of Deep Neural Networks",
		"authors": "Stanislaw Jastrzebski,Maciej Szymczak,Stanislav Fort,Devansh Arpit,Jacek Tabor,Kyunghyun Cho*,Krzysztof Geras*",
		"emails": "staszek.jastrzebski@gmail.com, msz93@o2.pl, stanislav.fort@gmail.com, devansharpit@gmail.com, jcktbr@gmail.com, kyunghyun.cho@nyu.edu, k.j.geras@nyu.edu",
		"TL;DR:": "In the early phase of training of deep neural networks there exists a \"break-even point\" which determines properties of the entire optimization trajectory.",
		"Abstract:": "The early phase of training of deep neural networks is critical for their final performance. In this work, we study how the hyperparameters of stochastic gradient descent (SGD) used in the early phase of training affect the rest of the optimization trajectory. We argue for the existence of the \"``break-even\" point on this trajectory, beyond which the curvature of the loss surface and noise in the gradient are implicitly regularized by SGD. In particular, we demonstrate on multiple classification tasks that using a large learning rate in the initial phase of training reduces the variance of the gradient, and improves the conditioning of the covariance of gradients. These effects are beneficial from the optimization perspective and become visible after the break-even point. Complementing prior work, we also show that using a low learning rate results in bad conditioning of the loss surface even for a neural network with batch normalization layers. In short, our work shows that key properties of the loss surface are strongly influenced by SGD in the early phase of training. We argue that studying the impact of the identified effects on generalization is a promising future direction.",
		"Keywords:": "generalization, sgd, learning rate, batch size, hessian, curvature, trajectory, optimization",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=r1g87C4KwB",
		"pdf_link": "https://openreview.net/pdf?id=r1g87C4KwB",
		"Code:": "https://anonymous.4open.science/r/787222e2-ad5e-4810-a788-e80f0fe7eff0/"
	},
	{
		"title": "ALBERT: A Lite BERT for Self-supervised Learning of Language Representations",
		"authors": "Zhenzhong Lan,Mingda Chen,Sebastian Goodman,Kevin Gimpel,Piyush Sharma,Radu Soricut",
		"emails": "lanzhzh@google.com, mchen@ttic.edu, seabass@google.com, kgimpel@ttic.edu, piyushsharma@google.com, rsoricut@google.com",
		"TL;DR:": "A new pretraining method that establishes new state-of-the-art results on the GLUE, RACE, and SQuAD benchmarks while having fewer parameters compared to BERT-large.",
		"Abstract:": "Increasing model size when pretraining natural language representations often results in improved performance on downstream tasks. However, at some point further model increases become harder due to GPU/TPU memory limitations and longer training times. To address these problems,  we present two parameter-reduction techniques to lower memory consumption and increase the training speed of BERT~\\citep{devlin2018bert}. Comprehensive empirical evidence shows that our proposed methods lead to models that scale much better compared to the original BERT. We also use a self-supervised loss that focuses on modeling inter-sentence coherence, and show it consistently helps downstream tasks with multi-sentence inputs. As a result, our best model establishes new state-of-the-art results on the GLUE, RACE, and \\squad benchmarks while having fewer parameters compared to BERT-large. The code and the pretrained models are available athttps://github.com/google-research/ALBERT.",
		"Keywords:": "Natural Language Processing, BERT, Representation Learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=H1eA7AEtvS",
		"pdf_link": "https://openreview.net/pdf?id=H1eA7AEtvS",
		"Code:": "https://github.com/google-research/ALBERT"
	},
	{
		"title": "Disentangling neural mechanisms for perceptual grouping",
		"authors": "Junkyung Kim*,Drew Linsley*,Kalpit Thakkar,Thomas Serre",
		"emails": "junkyung_kim@brown.edu, drew_linsley@brown.edu, kalpit_thakkar@brown.edu, thomas_serre@brown.edu",
		"TL;DR:": "Horizontal and top-down feedback connections are responsible for complementary perceptual grouping strategies in biological and recurrent vision systems.",
		"Abstract:": "Forming perceptual groups and individuating objects in visual scenes is an essential step towards visual intelligence. This ability is thought to arise in the brain from computations implemented by bottom-up, horizontal, and top-down connections between neurons. However, the relative contributions of these connections to perceptual grouping are poorly understood. We address this question by systematically evaluating neural network architectures featuring combinations bottom-up, horizontal, and top-down connections on two synthetic visual tasks, which stress low-level \"Gestalt\" vs. high-level object cues for perceptual grouping. We show that increasing the difficulty of either task strains learning for networks that rely solely on bottom-up connections. Horizontal connections resolve straining on tasks with Gestalt cues by supporting incremental grouping, whereas top-down connections rescue learning on tasks with high-level object cues by modifying coarse predictions about the position of the target object. Our findings dissociate the computational roles of bottom-up, horizontal and top-down connectivity, and demonstrate how a model featuring all of these interactions can more flexibly learn to form perceptual groups.",
		"Keywords:": "Perceptual grouping, visual cortex, recurrent feedback, horizontal connections, top-down connections",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=HJxrVA4FDS",
		"pdf_link": "https://openreview.net/pdf?id=HJxrVA4FDS",
		"Code:": "https://bit.ly/2wdQYGd"
	},
	{
		"title": "Learning to Plan in High Dimensions via Neural Exploration-Exploitation Trees",
		"authors": "Binghong Chen,Bo Dai,Qinjie Lin,Guo Ye,Han Liu,Le Song",
		"emails": "binghong@gatech.edu, bodai@google.com, qinjielin2018@u.northwestern.edu, guoye2018@u.northwestern.edu, hanliu@northwestern.edu, lsong@cc.gatech.edu",
		"TL;DR:": "We propose a meta path planning algorithm which exploits a novel attention-based neural module that can learn generalizable structures from prior experiences to drastically reduce the sample requirement for solving new path planning problems.",
		"Abstract:": "We propose a meta path planning algorithm named \\emph{Neural Exploration-Exploitation Trees~(NEXT)} for learning from prior experience for solving new path planning problems in high dimensional continuous state and action spaces. Compared to more classical sampling-based methods like RRT, our approach achieves much better sample efficiency in  high-dimensions and can benefit from prior experience of planning in similar environments. More specifically, NEXT exploits a novel neural architecture which can learn promising search directions from problem structures. The learned prior is then integrated into a UCB-type algorithm to achieve an online balance between \\emph{exploration} and \\emph{exploitation} when solving a new problem. We conduct thorough experiments to show that NEXT accomplishes new planning problems with more compact search trees and significantly outperforms state-of-the-art methods on several benchmarks.",
		"Keywords:": "learning to plan, representation learning, learning to design algorithm, reinforcement learning, meta learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rJgJDAVKvB",
		"pdf_link": "https://openreview.net/pdf?id=rJgJDAVKvB",
		"Code:": "https://github.com/NeurEXT/NEXT-learning-to-plan/blob/master/main.ipynb"
	},
	{
		"title": "Symplectic Recurrent Neural Networks",
		"authors": "Zhengdao Chen,Jianyu Zhang,Martin Arjovsky,Léon Bottou",
		"emails": "zc1216@nyu.edu, edzhang@tju.edu.cn, martinarjovsky@gmail.com, leonb@fb.com",
		"TL;DR:": "We propose a meta path planning algorithm which exploits a novel attention-based neural module that can learn generalizable structures from prior experiences to drastically reduce the sample requirement for solving new path planning problems.",
		"Abstract:": "We propose Symplectic Recurrent Neural Networks (SRNNs) as learning algorithms that capture the dynamics of physical systems from observed trajectories. SRNNs model the Hamiltonian function of the system by a neural networks, and leverage symplectic integration, multiple-step training and initial state optimization to address the challenging numerical issues associated with Hamiltonian systems. We show SRNNs succeed reliably on complex and noisy Hamiltonian systems. Finally, we show how to augment the SRNN integration scheme in order to handle stiff dynamical systems such as bouncing billiards.",
		"Keywords:": "Hamiltonian systems, learning physical laws, symplectic integrators, recurrent neural networks, inverse problems",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BkgYPREtPr",
		"pdf_link": "https://openreview.net/pdf?id=BkgYPREtPr",
		"Code:": "https://github.com/NeurEXT/NEXT-learning-to-plan/blob/master/main.ipynb"
	},
	{
		"title": "Asymptotics of Wide Networks from Feynman Diagrams",
		"authors": "Ethan Dyer,Guy Gur-Ari",
		"emails": "edyer@google.com, guyga@google.com",
		"TL;DR:": "A general method for computing the asymptotic behavior of wide networks using Feynman diagrams",
		"Abstract:": "Understanding the asymptotic behavior of wide networks is of considerable interest. In this work, we present a general method for analyzing this large width behavior. The method is an adaptation of Feynman diagrams, a standard tool for computing multivariate Gaussian integrals. We apply our method to study training dynamics, improving existing bounds and deriving new results on wide network evolution during stochastic gradient descent. Going beyond the strict large width limit, we present closed-form expressions for higher-order terms governing wide network training, and test these predictions empirically.",
		"Keywords:": "Hamiltonian systems, learning physical laws, symplectic integrators, recurrent neural networks, inverse problems",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=S1gFvANKDS",
		"pdf_link": "https://openreview.net/pdf?id=S1gFvANKDS",
		"Code:": "https://github.com/NeurEXT/NEXT-learning-to-plan/blob/master/main.ipynb"
	},
	{
		"title": "Learning The Difference That Makes A Difference With Counterfactually-Augmented Data",
		"authors": "Divyansh Kaushik,Eduard Hovy,Zachary Lipton",
		"emails": "dkaushik@cs.cmu.edu, hovy@cmu.edu, zlipton@cmu.edu",
		"TL;DR:": "Humans in the loop revise documents to accord with counterfactual labels, resulting resource helps to reduce reliance on spurious associations.",
		"Abstract:": "Despite alarm over the reliance of machine learning systems on so-called spurious patterns, the term lacks coherent meaning in standard statistical frameworks. However, the language of causality offers clarity: spurious associations are due to confounding (e.g., a common cause), but not direct or indirect causal effects. In this paper, we focus on natural language processing, introducing methods and resources  for training models less sensitive to spurious patterns. Given documents and their initial labels, we task humans with revising each document so that it (i) accords with a counterfactual target label; (ii) retains internal coherence;  and (iii) avoids unnecessary changes. Interestingly, on sentiment analysis and natural language inference tasks, classifiers trained on original data fail on their  counterfactually-revised counterparts and vice versa. Classifiers trained on combined datasets  perform remarkably well, just shy of those specialized to either domain. While classifiers trained on either original or manipulated data alone  are sensitive to spurious features (e.g., mentions of genre), models trained on the combined data are less sensitive to this signal. Both datasets are publicly available.",
		"Keywords:": "humans in the loop, annotation artifacts, text classification, sentiment analysis, natural language inference",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=Sklgs0NFvr",
		"pdf_link": "https://openreview.net/pdf?id=Sklgs0NFvr",
		"Code:": "https://github.com/dkaushik96/counterfactually-augmented-data"
	},
	{
		"title": "Is a Good Representation Sufficient for Sample Efficient Reinforcement Learning?",
		"authors": "Simon S. Du,Sham M. Kakade,Ruosong Wang,Lin F. Yang",
		"emails": "ssdu@ias.edu, sham@cs.washington.edu, ruosongw@andrew.cmu.edu, linyang@ee.ucla.edu",
		"TL;DR:": "Exponential lower bounds for value-based and policy-based reinforcement learning with function approximation.",
		"Abstract:": "Modern deep learning methods provide effective means to learn good representations. However, is a good representation itself sufficient for sample efficient reinforcement learning? This question has largely been studied only with respect to (worst-case) approximation error, in the more classical approximate dynamic programming literature. With regards to the statistical viewpoint, this question is largely unexplored, and the extant body of literature mainly focuses on conditions which \\emph{permit} sample efficient reinforcement learning with little understanding of what are \\emph{necessary} conditions for efficient reinforcement learning.\n      This work shows that, from the statistical viewpoint, the situation is far subtler than suggested by the more traditional approximation viewpoint, where the requirements on the representation that suffice for sample efficient RL are even more stringent. Our main results provide sharp thresholds for reinforcement learning methods, showing that there are hard limitations on what constitutes good function approximation (in terms of the dimensionality of the representation), where we focus on natural representational conditions relevant to value-based, model-based, and policy-based learning. These lower bounds highlight that having a good (value-based, model-based, or policy-based) representation in and of itself is insufficient for efficient reinforcement learning, unless the quality of this approximation passes certain hard thresholds. Furthermore, our lower bounds also imply exponential separations on the sample complexity between 1) value-based learning with perfect representation and value-based learning with a good-but-not-perfect representation, 2) value-based learning and policy-based learning, 3) policy-based learning and supervised learning and 4) reinforcement learning and imitation learning.",
		"Keywords:": "reinforcement learning, function approximation, lower bound, representation",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=r1genAVKPB",
		"pdf_link": "https://openreview.net/pdf?id=r1genAVKPB",
		"Code:": "https://github.com/dkaushik96/counterfactually-augmented-data"
	},
	{
		"title": "Simplified Action Decoder for Deep Multi-Agent Reinforcement Learning",
		"authors": "Hengyuan Hu,Jakob N Foerster",
		"emails": "hengyuan@fb.com, jakobfoerster@gmail.com",
		"TL;DR:": "We develop Simplified Action Decoder, a simple MARL algorithm that beats previous SOTA on Hanabi by a big margin across 2- to 5-player games.",
		"Abstract:": "In recent years we have seen fast progress on a number of benchmark problems in AI, with modern methods achieving near or super human performance in Go, Poker and Dota. One common aspect of all of these challenges is that they are by design adversarial or, technically speaking, zero-sum. In contrast to these settings, success in the real world commonly requires humans to collaborate and communicate with others, in settings that are, at least partially, cooperative. In the last year, the card game Hanabi has been established as a new benchmark environment for AI to fill this gap. In particular, Hanabi is interesting to humans since it is entirely focused on theory of mind, i.e. the ability to effectively reason over the intentions, beliefs and point of view of other agents when observing their actions. Learning to be informative when observed by others is an interesting challenge for Reinforcement Learning (RL): Fundamentally, RL requires agents to explore in order to discover good policies. However, when done naively, this randomness will inherently make their actions less informative to others during training. We present a new deep multi-agent RL method, the Simplified Action Decoder (SAD), which resolves this contradiction exploiting the centralized training phase. During training SAD allows other agents to not only observe the (exploratory) action chosen, but agents instead also observe the greedy action of their team mates. By combining this simple intuition with an auxiliary task for state prediction and best practices for multi-agent learning, SAD establishes a new state of the art for 2-5 players on the self-play part of the Hanabi challenge.",
		"Keywords:": "multi-agent RL, theory of mind",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=B1xm3RVtwB",
		"pdf_link": "https://openreview.net/pdf?id=B1xm3RVtwB",
		"Code:": "https://bit.ly/2mBJLyk"
	},
	{
		"title": "Network Deconvolution",
		"authors": "Chengxi Ye,Matthew Evanusa,Hua He,Anton Mitrokhin,Tom Goldstein,James A. Yorke,Cornelia Fermuller,Yiannis Aloimonos",
		"emails": "yechengxi@gmail.com, mevanusa@umd.edu, huah@umd.edu, amitrokh@umd.edu, tomg@cs.umd.edu, yorke@umd.edu, fer@umiacs.umd.edu, yiannis@cs.umd.edu",
		"TL;DR:": "We propose a method called network deconvolution that resembles animal vision system to train convolution networks better.",
		"Abstract:": "Convolution is a central operation in Convolutional Neural Networks (CNNs), which applies a kernel to overlapping regions shifted across the image. However, because of the strong  correlations in real-world image data, convolutional kernels are in effect re-learning redundant data. In this work, we show that this redundancy has made neural network training challenging, and propose network deconvolution, a procedure which optimally removes pixel-wise and channel-wise correlations before the data is fed into each layer. Network deconvolution can be efficiently calculated at a fraction of the computational cost of a convolution layer. We also show that the deconvolution filters in the first layer of the network resemble the center-surround structure found in biological neurons in the visual regions of the brain. Filtering with such kernels results in a sparse representation, a desired property that has been missing in the training of neural networks. Learning from the sparse representation promotes faster convergence and superior results without the use of batch normalization. We apply our network deconvolution operation to 10 modern neural network models by replacing batch normalization within each. Extensive experiments show that the network deconvolution operation is able to deliver performance improvement in all cases on the CIFAR-10, CIFAR-100, MNIST, Fashion-MNIST, Cityscapes, and ImageNet datasets.",
		"Keywords:": "convolutional networks, network deconvolution, whitening",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rkeu30EtvS",
		"pdf_link": "https://openreview.net/pdf?id=rkeu30EtvS",
		"Code:": "https://github.com/yechengxi/deconvolution"
	},
	{
		"title": "Neural Symbolic Reader: Scalable Integration of Distributed and Symbolic Representations for Reading Comprehension",
		"authors": "Xinyun Chen,Chen Liang,Adams Wei Yu,Denny Zhou,Dawn Song,Quoc V. Le",
		"emails": "xinyun.chen@berkeley.edu, crazydonkey@google.com, adamsyuwei@google.com, dennyzhou@google.com, dawnsong.travel@gmail.com, qvl@google.com",
		"TL;DR:": "We propose a method called network deconvolution that resembles animal vision system to train convolution networks better.",
		"Abstract:": "Integrating distributed representations with symbolic operations is essential for reading comprehension requiring complex reasoning, such as counting, sorting and arithmetics, but most existing approaches are hard to scale to more domains or more complex reasoning. In this work, we propose the Neural Symbolic Reader (NeRd), which includes a reader, e.g., BERT, to encode the passage and question, and a programmer, e.g., LSTM, to generate a program that is executed to produce the answer. Compared to previous works, NeRd is more scalable in two aspects: (1) domain-agnostic, i.e., the same neural architecture works for different domains; (2) compositional, i.e., when needed, complex programs can be generated by recursively applying the predefined operators, which become executable and interpretable representations for more complex reasoning. Furthermore, to overcome the challenge of training NeRd with weak supervision, we apply data augmentation techniques and hard Expectation-Maximization (EM) with thresholding. On DROP, a challenging reading comprehension dataset that requires discrete reasoning, NeRd achieves 1.37%/1.18% absolute improvement over the state-of-the-art on EM/F1 metrics. With the same architecture, NeRd significantly outperforms the baselines on MathQA, a math problem benchmark that requires multiple steps of reasoning, by 25.5% absolute increment on accuracy when trained on all the annotated programs. More importantly, NeRd still beats the baselines even when only 20% of the program annotations are given.",
		"Keywords:": "neural symbolic, reading comprehension, question answering",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=ryxjnREFwH",
		"pdf_link": "https://openreview.net/pdf?id=ryxjnREFwH",
		"Code:": "https://github.com/yechengxi/deconvolution"
	},
	{
		"title": "Real or Not Real, that is the Question",
		"authors": "Yuanbo Xiangli*,Yubin Deng*,Bo Dai*,Chen Change Loy,Dahua Lin",
		"emails": "xy019@ie.cuhk.edu.hk, danny.s.deng.ds@gmail.com, doubledaibo@gmail.com, ccloy@ntu.edu.sg, dhlin@ie.cuhk.edu.hk",
		"TL;DR:": "We propose a method called network deconvolution that resembles animal vision system to train convolution networks better.",
		"Abstract:": "While generative adversarial networks (GAN) have been widely adopted in various topics, in this paper we generalize the standard GAN to a new perspective by treating realness as a random variable that can be estimated from multiple angles. In this generalized framework, referred to as RealnessGAN, the discriminator outputs a distribution as the measure of realness. While RealnessGAN shares similar theoretical guarantees with the standard GAN, it provides more insights on adversarial learning. More importantly, compared to multiple baselines, RealnessGAN provides stronger guidance for the generator, achieving improvements on both synthetic and real-world datasets. Moreover, it enables the basic DCGAN architecture to generate realistic images at 1024*1024 resolution when trained from scratch.",
		"Keywords:": "GAN, generalization, realness, loss function",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=B1lPaCNtPB",
		"pdf_link": "https://openreview.net/pdf?id=B1lPaCNtPB",
		"Code:": "https://github.com/kam1107/RealnessGAN"
	},
	{
		"title": "Dream to Control: Learning Behaviors by Latent Imagination",
		"authors": "Danijar Hafner,Timothy Lillicrap,Jimmy Ba,Mohammad Norouzi",
		"emails": "mail@danijar.com, countzero@google.com, jba@cs.toronto.edu, mnorouzi@google.com",
		"TL;DR:": "We present Dreamer, an agent that learns long-horizon behaviors purely by latent imagination using analytic value gradients.",
		"Abstract:": "Learned world models summarize an agent's experience to facilitate learning complex behaviors. While learning world models from high-dimensional sensory inputs is becoming feasible through deep learning, there are many potential ways for deriving behaviors from them. We present Dreamer, a reinforcement learning agent that solves long-horizon tasks from images purely by latent imagination. We efficiently learn behaviors by propagating analytic gradients of learned state values back through trajectories imagined in the compact state space of a learned world model. On 20 challenging visual control tasks, Dreamer exceeds existing approaches in data-efficiency, computation time, and final performance.",
		"Keywords:": "world model, latent dynamics, imagination, planning by backprop, policy optimization, planning, reinforcement learning, control, representations, latent variable model, visual control, value function",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=S1lOTC4tDS",
		"pdf_link": "https://openreview.net/pdf?id=S1lOTC4tDS",
		"Code:": "https://danijar.com/dreamer"
	},
	{
		"title": "A Probabilistic Formulation of Unsupervised Text Style Transfer",
		"authors": "Junxian He,Xinyi Wang,Graham Neubig,Taylor Berg-Kirkpatrick",
		"emails": "junxianh@cs.cmu.edu, xinyiw1@cs.cmu.edu, gneubig@cs.cmu.edu, tberg@eng.ucsd.edu",
		"TL;DR:": "We formulate a probabilistic latent sequence model to tackle unsupervised text style transfer, and show its effectiveness across a suite of unsupervised text style transfer tasks.",
		"Abstract:": "We present a deep generative model for unsupervised text style transfer that unifies previously proposed non-generative techniques. Our probabilistic approach models non-parallel data from two domains as a partially observed parallel corpus. By hypothesizing a parallel latent sequence that generates each observed sequence, our model learns to transform sequences from one domain to another in a completely unsupervised fashion. In contrast with traditional generative sequence models (e.g. the HMM), our model makes few assumptions about the data it generates: it uses a recurrent language model as a prior and an encoder-decoder as a transduction distribution. While computation of marginal data likelihood is intractable in this model class, we show that amortized variational inference admits a practical surrogate. Further, by drawing connections between our variational objective and other recent unsupervised style transfer and machine translation techniques, we show how our probabilistic view can unify some known non-generative objectives such as backtranslation and adversarial loss. Finally, we demonstrate the effectiveness of our method on a wide range of unsupervised style transfer tasks, including sentiment transfer, formality transfer, word decipherment, author imitation, and related language translation. Across all style transfer tasks, our approach yields substantial gains over state-of-the-art non-generative baselines, including the state-of-the-art unsupervised machine translation techniques that our approach generalizes. Further, we conduct experiments on a standard unsupervised machine translation task and find that our unified approach matches the current state-of-the-art.",
		"Keywords:": "unsupervised text style transfer, deep latent sequence model",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=HJlA0C4tPS",
		"pdf_link": "https://openreview.net/pdf?id=HJlA0C4tPS",
		"Code:": "https://danijar.com/dreamer"
	},
	{
		"title": "Emergent Tool Use From Multi-Agent Autocurricula",
		"authors": "Bowen Baker,Ingmar Kanitscheider,Todor Markov,Yi Wu,Glenn Powell,Bob McGrew,Igor Mordatch",
		"emails": "bowen@openai.com, ingmar@openai.com, todor@openai.com, jxwuyi@openai.com, glenn@openai.com, bmcgrew@openai.com, imordatch@google.com",
		"TL;DR:": "We formulate a probabilistic latent sequence model to tackle unsupervised text style transfer, and show its effectiveness across a suite of unsupervised text style transfer tasks.",
		"Abstract:": "Through multi-agent competition, the simple objective of hide-and-seek, and standard reinforcement learning algorithms at scale, we find that agents create a self-supervised autocurriculum inducing multiple distinct rounds of emergent strategy, many of which require sophisticated tool use and coordination. We find clear evidence of six emergent phases in agent strategy in our environment, each of which creates a new pressure for the opposing team to adapt; for instance, agents learn to build multi-object shelters using moveable boxes which in turn leads to agents discovering that they can overcome obstacles using ramps. We further provide evidence that multi-agent competition may scale better with increasing environment complexity and leads to behavior that centers around far more human-relevant skills than other self-supervised reinforcement learning methods such as intrinsic motivation. Finally, we propose transfer and fine-tuning as a way to quantitatively evaluate targeted capabilities, and we compare hide-and-seek agents to both intrinsic motivation and random initialization baselines in a suite of domain-specific intelligence tests.",
		"Keywords:": "unsupervised text style transfer, deep latent sequence model",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=SkxpxJBKwS",
		"pdf_link": "https://openreview.net/pdf?id=SkxpxJBKwS",
		"Code:": "https://github.com/openai/multi-agent-emergence-environments"
	},
	{
		"title": "NAS-Bench-201: Extending the Scope of Reproducible Neural Architecture Search",
		"authors": "Xuanyi Dong,Yi Yang",
		"emails": "xuanyi.dxy@gmail.com, yi.yang@uts.edu.au",
		"TL;DR:": "A NAS benchmark applicable to almost any NAS algorithms.",
		"Abstract:": "Neural architecture search (NAS) has achieved breakthrough success in a great number of applications in the past few years.\n      It could be time to take a step back and analyze the good and bad aspects in the field of NAS. A variety of algorithms search architectures under different search space. These searched architectures are trained using different setups, e.g., hyper-parameters, data augmentation, regularization. This raises a comparability problem when comparing the performance of various NAS algorithms. NAS-Bench-101 has shown success to alleviate this problem. In this work, we propose an extension to NAS-Bench-101: NAS-Bench-201 with a different search space, results on multiple datasets, and more diagnostic information. NAS-Bench-201 has a fixed search space and provides a unified benchmark for almost any up-to-date NAS algorithms. The design of our search space is inspired by the one used in the most popular cell-based searching algorithms, where a cell is represented as a directed acyclic graph. Each edge here is associated with an operation selected from a predefined operation set. For it to be applicable for all NAS algorithms, the search space defined in NAS-Bench-201 includes all possible architectures generated by 4 nodes and 5 associated operation options, which results in 15,625 neural cell candidates in total. The training log using the same setup and the performance for each architecture candidate are provided for three datasets. This allows researchers to avoid unnecessary repetitive training for selected architecture and focus solely on the search algorithm itself. The training time saved for every architecture also largely improves the efficiency of most NAS algorithms and presents a more computational cost friendly NAS community for a broader range of researchers. We provide additional diagnostic information such as fine-grained loss and accuracy, which can give inspirations to new designs of NAS algorithms. In further support of the proposed NAS-Bench-102, we have analyzed it from many aspects and benchmarked 10 recent NAS algorithms, which verify its applicability.",
		"Keywords:": "Neural Architecture Search, AutoML, Benchmark",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=HJxyZkBKDr",
		"pdf_link": "https://openreview.net/pdf?id=HJxyZkBKDr",
		"Code:": "https://github.com/D-X-Y/NAS-Bench-201"
	},
	{
		"title": "Strategies for Pre-training Graph Neural Networks",
		"authors": "Weihua Hu*,Bowen Liu*,Joseph Gomes,Marinka Zitnik,Percy Liang,Vijay Pande,Jure Leskovec",
		"emails": "weihuahu@stanford.edu, liubowen@stanford.edu, joegomes@stanford.edu, marinka@cs.stanford.edu, pliang@cs.stanford.edu, pande@stanford.edu, jure@cs.stanford.edu",
		"TL;DR:": "We develop a strategy for pre-training Graph Neural Networks (GNNs) and systematically study its effectiveness on multiple datasets, GNN architectures, and diverse downstream tasks.",
		"Abstract:": "Many applications of machine learning require a model to make accurate pre-dictions on test examples that are distributionally different from training ones, while task-specific labels are scarce during training. An effective approach to this challenge is to pre-train a model on related tasks where data is abundant, and then fine-tune it on a downstream task of interest. While pre-training has been effective in many language and vision domains, it remains an open question how to effectively use pre-training on graph datasets. In this paper, we develop a new strategy and self-supervised methods for pre-training Graph Neural Networks (GNNs). The key to the success of our strategy is to pre-train an expressive GNN at the level of individual nodes as well as entire graphs so that the GNN can learn useful local and global representations simultaneously. We systematically study pre-training on multiple graph classification datasets. We find that naïve strategies, which pre-train GNNs at the level of either entire graphs or individual nodes, give limited improvement and can even lead to negative transfer on many downstream tasks. In contrast, our strategy avoids negative transfer and improves generalization significantly across downstream tasks, leading up to 9.4% absolute improvements in ROC-AUC over non-pre-trained models and achieving state-of-the-art performance for molecular property prediction and protein function prediction.",
		"Keywords:": "Pre-training, Transfer learning, Graph Neural Networks",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=HJlWWJSFDH",
		"pdf_link": "https://openreview.net/pdf?id=HJlWWJSFDH",
		"Code:": "https://github.com/snap-stanford/pretrain-gnns/"
	},
	{
		"title": "Behaviour Suite for Reinforcement Learning",
		"authors": "Ian Osband,Yotam Doron,Matteo Hessel,John Aslanides,Eren Sezener,Andre Saraiva,Katrina McKinney,Tor Lattimore,Csaba Szepesvari,Satinder Singh,Benjamin Van Roy,Richard Sutton,David Silver,Hado Van Hasselt",
		"emails": "ian.osband@gmail.com, ydoron@google.com, mtthss@google.com, jaslanides@google.com, esezener@google.com, andresnds@google.com, mckinneyk@google.com, lattimore@google.com, szepi@google.com, baveja@google.com, benvanroy@google.com, suttonr@google.com, davidsilver@google.com, hado@google.com",
		"TL;DR:": "Bsuite is a collection of carefully-designed experiments that investigate the core capabilities of RL agents.",
		"Abstract:": "This paper introduces the Behaviour Suite for Reinforcement Learning, or bsuite for short. bsuite is a collection of carefully-designed experiments that investigate core capabilities of reinforcement learning (RL) agents with two objectives. First, to collect clear, informative and scalable problems that capture key issues in the design of general and efficient learning algorithms. Second, to study agent behaviour through their performance on these shared benchmarks. To complement this effort, we open source this http URL, which automates evaluation and analysis of any agent on bsuite. This library facilitates reproducible and accessible research on the core issues in RL, and ultimately the design of superior learning algorithms. Our code is Python, and easy to use within existing projects. We include examples with OpenAI Baselines, Dopamine as well as new reference implementations. Going forward, we hope to incorporate more excellent experiments from the research community, and commit to a periodic review of bsuite from a committee of prominent researchers.",
		"Keywords:": "reinforcement learning, benchmark, core issues, scalability, reproducibility",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rygf-kSYwH",
		"pdf_link": "https://openreview.net/pdf?id=rygf-kSYwH",
		"Code:": "https://github.com/deepmind/bsuite"
	},
	{
		"title": "FreeLB: Enhanced Adversarial Training for Natural Language Understanding",
		"authors": "Chen Zhu,Yu Cheng,Zhe Gan,Siqi Sun,Tom Goldstein,Jingjing Liu",
		"emails": "chenzhu@cs.umd.edu, yu.cheng@microsoft.com, zhe.gan@microsoft.com, siqi.sun@microsoft.com, tomg@cs.umd.edu, jingjl@microsoft.com",
		"TL;DR:": "Bsuite is a collection of carefully-designed experiments that investigate the core capabilities of RL agents.",
		"Abstract:": "Adversarial training, which minimizes the maximal risk for label-preserving input perturbations, has proved to be effective for improving the generalization of language models. In this work, we propose a novel adversarial training algorithm, FreeLB, that promotes higher invariance in the embedding space, by adding adversarial perturbations to word embeddings and minimizing the resultant adversarial risk inside different regions around input samples. To validate the effectiveness of the proposed approach, we apply it to Transformer-based models for natural language understanding and commonsense reasoning tasks. Experiments on the GLUE benchmark show that when applied only to the finetuning stage, it is able to improve the overall test scores of BERT-base model from 78.3 to 79.4, and RoBERTa-large model from 88.5 to 88.8. In addition, the proposed approach achieves state-of-the-art single-model test accuracies of 85.44% and 67.75% on ARC-Easy and ARC-Challenge. Experiments on CommonsenseQA benchmark further demonstrate that FreeLB can be generalized and boost the performance of RoBERTa-large model on other tasks as well.",
		"Keywords:": "reinforcement learning, benchmark, core issues, scalability, reproducibility",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BygzbyHFvB",
		"pdf_link": "https://openreview.net/pdf?id=BygzbyHFvB",
		"Code:": "https://github.com/zhuchen03/FreeLB"
	},
	{
		"title": "Kernelized Wasserstein Natural Gradient",
		"authors": "M Arbel,A Gretton,W Li,G Montufar",
		"emails": "michael.n.arbel@gmail.com, arthur.gretton@gmail.com, wcli@math.ucla.edu, guidomontufar@gmail.com",
		"TL;DR:": "Estimator for the Wasserstein natural gradient",
		"Abstract:": "Many machine learning problems can be expressed as the optimization of some cost functional over a parametric family of probability distributions. It is often beneficial to solve such optimization problems using natural gradient methods. These methods are invariant to the parametrization of the family, and thus can yield more effective optimization. Unfortunately, computing the natural gradient is challenging as it requires inverting a high dimensional matrix at each iteration. We propose a general framework to approximate the natural gradient for the Wasserstein metric, by leveraging a dual formulation of the metric restricted to a Reproducing Kernel Hilbert Space. Our approach leads to an estimator for gradient direction that can trade-off accuracy and computational cost, with theoretical guarantees. We verify its accuracy on simple examples, and show the advantage of using such an estimator in classification tasks on \\texttt{Cifar10} and \\texttt{Cifar100} empirically.",
		"Keywords:": "kernel methods, natural gradient, information geometry, Wasserstein metric",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=Hklz71rYvS",
		"pdf_link": "https://openreview.net/pdf?id=Hklz71rYvS",
		"Code:": "https://github.com/zhuchen03/FreeLB"
	},
	{
		"title": "And the Bit Goes Down: Revisiting the Quantization of Neural Networks",
		"authors": "Pierre Stock,Armand Joulin,Rémi Gribonval,Benjamin Graham,Hervé Jégou",
		"emails": "pstock@fb.com, ajoulin@fb.com, remi.gribonval@inria.fr, benjamingraham@fb.com, rvj@fb.com",
		"TL;DR:": "Using a structured quantization technique aiming at better in-domain reconstruction to compress convolutional neural networks",
		"Abstract:": "In this paper, we address the problem of reducing the memory footprint of convolutional network architectures. We introduce a vector quantization method that aims at preserving the quality of the reconstruction of the network outputs rather than its weights. The principle of our approach is that it minimizes the loss reconstruction error for in-domain inputs. Our method only requires a set of unlabelled data at quantization time and allows for efficient inference on CPU by using byte-aligned codebooks to store the compressed weights. We validate our approach by quantizing a high performing ResNet-50 model to a memory size of 5MB (20x compression factor) while preserving a top-1 accuracy of 76.1% on ImageNet object classification and by compressing a Mask R-CNN with a 26x factor.",
		"Keywords:": "compression, quantization",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rJehVyrKwH",
		"pdf_link": "https://openreview.net/pdf?id=rJehVyrKwH",
		"Code:": "https://drive.google.com/file/d/12QK7onizf2ArpEBK706ly8bNfiM9cPzp/view?usp=sharing"
	},
	{
		"title": "A Latent Morphology Model for Open-Vocabulary Neural Machine Translation",
		"authors": "Duygu Ataman,Wilker Aziz,Alexandra Birch",
		"emails": "duyguataman@gmail.com, will.aziz@gmail.com, a.birch@ed.ac.uk",
		"TL;DR:": "Using a structured quantization technique aiming at better in-domain reconstruction to compress convolutional neural networks",
		"Abstract:": "Translation into morphologically-rich languages challenges neural machine translation (NMT) models with extremely sparse vocabularies where atomic treatment of surface forms is unrealistic. This problem is typically addressed by either pre-processing words into subword units or performing translation directly at the level of characters. The former is based on word segmentation algorithms optimized using corpus-level statistics with no regard to the translation task. The latter learns directly from translation data but requires rather deep architectures. In this paper, we propose to translate words by modeling word formation through a hierarchical latent variable model which mimics the process of morphological inflection. Our model generates words one character at a time by composing two latent representations: a continuous one, aimed at capturing the lexical semantics, and a set of (approximately) discrete features, aimed at capturing the morphosyntactic function, which are shared among different surface forms. Our model achieves better accuracy in translation into three morphologically-rich languages than conventional open-vocabulary NMT methods, while also demonstrating a better generalization capacity under low to mid-resource settings.",
		"Keywords:": "neural machine translation, low-resource languages, latent-variable models",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BJxSI1SKDH",
		"pdf_link": "https://openreview.net/pdf?id=BJxSI1SKDH",
		"Code:": "https://drive.google.com/file/d/12QK7onizf2ArpEBK706ly8bNfiM9cPzp/view?usp=sharing"
	},
	{
		"title": "Understanding Why Neural Networks Generalize Well Through GSNR of Parameters",
		"authors": "Jinlong Liu,Yunzhi Bai,Guoqing Jiang,Ting Chen,Huayan Wang",
		"emails": "ljlwykqh@126.com, yunzhi.bai@outlook.fr, jianggq@pku.edu.cn, roushi0322@sina.cn, wanghuayan@kuaishou.com",
		"TL;DR:": "Using a structured quantization technique aiming at better in-domain reconstruction to compress convolutional neural networks",
		"Abstract:": "As deep neural networks (DNNs) achieve tremendous success across many application domains, researchers tried to explore in many aspects on why they generalize well. In this paper, we provide a novel perspective on these issues using the gradient signal to noise ratio (GSNR) of parameters during training process of DNNs. The GSNR of a parameter is simply defined as the ratio between its gradient's squared mean and variance, over the data distribution. Based on several approximations, we establish a quantitative relationship between model parameters' GSNR and the generalization gap. This relationship indicates that larger GSNR during training process leads to better generalization performance. Futher, we show that, different from that of shallow models (e.g. logistic regression, support vector machines), the gradient descent optimization dynamics of DNNs naturally produces large GSNR during training, which is probably the key to DNNs’ remarkable generalization ability.",
		"Keywords:": "DNN, generalization, GSNR, gradient descent",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=HyevIJStwH",
		"pdf_link": "https://openreview.net/pdf?id=HyevIJStwH",
		"Code:": "https://drive.google.com/file/d/12QK7onizf2ArpEBK706ly8bNfiM9cPzp/view?usp=sharing"
	},
	{
		"title": "Model Based Reinforcement Learning for Atari",
		"authors": "Łukasz Kaiser,Mohammad Babaeizadeh,Piotr Miłos,Błażej Osiński,Roy H Campbell,Konrad Czechowski,Dumitru Erhan,Chelsea Finn,Piotr Kozakowski,Sergey Levine,Afroz Mohiuddin,Ryan Sepassi,George Tucker,Henryk Michalewski",
		"emails": "lukaszkaiser@google.com, mbz@google.com, pmilos@mimuw.edu.pl, blazej.osinski@gmail.com, rhc@illinois.edu, konrad.czechowski@gmail.com, dumitru@google.com, chelseaf@google.com, kozak000@gmail.com, slevine@google.com, afrozm@google.com, rsepassi@google.com, gjt@google.com, henrykmichalewski@gmail.com",
		"TL;DR:": "We use video prediction models, a model-based reinforcement learning algorithm and 2h of gameplay per game to train agents for 26 Atari games.",
		"Abstract:": "Model-free reinforcement learning (RL) can be used to learn effective policies for complex tasks, such as Atari games, even from image observations. However, this typically requires very large amounts of interaction -- substantially more, in fact, than a human would need to learn the same games. How can people learn so quickly? Part of the answer may be that people can learn how the game works and predict which actions will lead to desirable outcomes. In this paper, we explore how video prediction models can similarly enable agents to solve Atari games with fewer interactions than model-free methods. We describe Simulated Policy Learning (SimPLe), a complete model-based deep RL algorithm based on video prediction models and present a comparison of several model architectures, including a novel architecture that yields the best results in our setting. Our experiments evaluate SimPLe on a range of Atari games in low data regime of 100k interactions between the agent and the environment, which corresponds to two hours of real-time play. In most games SimPLe outperforms state-of-the-art model-free algorithms, in some games by over an order of magnitude.",
		"Keywords:": "reinforcement learning, model based rl, video prediction model, atari",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=S1xCPJHtDB",
		"pdf_link": "https://openreview.net/pdf?id=S1xCPJHtDB",
		"Code:": "http://bit.ly/2wjgn1a"
	},
	{
		"title": "Disagreement-Regularized Imitation Learning",
		"authors": "Kiante Brantley,Wen Sun,Mikael Henaff",
		"emails": "kdbrant@cs.umd.edu, wen.sun@microsoft.com, mihenaff@microsoft.com",
		"TL;DR:": "Method for addressing covariate shift in imitation learning using ensemble uncertainty",
		"Abstract:": "We present a simple and effective algorithm designed to address the covariate shift problem in imitation learning. It operates by training an ensemble of policies on the expert demonstration data, and using the variance of their predictions as a cost which is minimized with RL together with a supervised behavioral cloning cost. Unlike adversarial imitation methods, it uses a fixed reward function which is easy to optimize. We prove a regret bound for the algorithm which is linear in the time horizon multiplied by a coefficient which we show to be low for certain problems in which behavioral cloning fails. We evaluate our algorithm empirically across multiple pixel-based Atari environments and continuous control tasks, and show that it matches or significantly outperforms behavioral cloning and generative adversarial imitation learning.",
		"Keywords:": "imitation learning, reinforcement learning, uncertainty",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rkgbYyHtwB",
		"pdf_link": "https://openreview.net/pdf?id=rkgbYyHtwB",
		"Code:": "http://bit.ly/2wjgn1a"
	},
	{
		"title": "Stable Rank Normalization for Improved Generalization in Neural Networks and GANs",
		"authors": "Amartya Sanyal,Philip H. Torr,Puneet K. Dokania",
		"emails": "amartya.sanyal@cs.ox.ac.uk, philip.torr@eng.ox.ac.uk, puneet@robots.ox.ac.uk",
		"TL;DR:": "We propose Stable Rank Normalisation, a new regularisor based on recent generelization bounds and show how to optimize it with extensive experiments.",
		"Abstract:": "Exciting new work on generalization bounds for neural networks (NN) given by Bartlett et al. (2017); Neyshabur et al. (2018) closely depend on two parameter- dependant quantities: the Lipschitz constant upper bound and the stable rank (a softer version of rank). Even though these bounds typically have minimal practical utility, they facilitate questions on whether controlling such quantities together could improve the generalization behaviour of NNs in practice. To this end, we propose stable rank normalization (SRN), a novel, provably optimal, and computationally efficient weight-normalization scheme which minimizes the stable rank of a linear operator. Surprisingly we find that SRN, despite being non-convex, can be shown to have a unique optimal solution. We provide extensive analyses across a wide variety of NNs (DenseNet, WideResNet, ResNet, Alexnet, VGG), where applying SRN to their linear layers leads to improved classification accuracy, while simultaneously showing improvements in genealization, evaluated empirically using—(a) shattering experiments (Zhang et al., 2016); and (b) three measures of sample complexity by Bartlett et al. (2017), Neyshabur et al. (2018), & Wei & Ma. Additionally, we show that, when applied to the discriminator of GANs, it improves Inception, FID, and Neural divergence scores, while learning mappings with low empirical Lipschitz constant.",
		"Keywords:": "Generelization, regularization, empirical lipschitz",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=H1enKkrFDB",
		"pdf_link": "https://openreview.net/pdf?id=H1enKkrFDB",
		"Code:": "http://bit.ly/2wjgn1a"
	},
	{
		"title": "Measuring the Reliability of Reinforcement Learning Algorithms",
		"authors": "Stephanie C.Y. Chan,Samuel Fishman,Anoop Korattikara,John Canny,Sergio Guadarrama",
		"emails": "scychan@google.com, sfishman@google.com, kbanoop@google.com, canny@google.com, sguada@google.com",
		"TL;DR:": "A novel set of metrics for measuring reliability of reinforcement learning algorithms (+ accompanying statistical tests)",
		"Abstract:": "Lack of reliability is a well-known issue for reinforcement learning (RL) algorithms. This problem has gained increasing attention in recent years, and efforts to improve it have grown substantially. To aid RL researchers and production users with the evaluation and improvement of reliability, we propose a set of metrics that quantitatively measure different aspects of reliability. In this work, we focus on variability and risk, both during training and after learning (on a fixed policy). We designed these metrics to be general-purpose, and we also designed complementary statistical tests to enable rigorous comparisons on these metrics. In this paper, we first describe the desired properties of the metrics and their design, the aspects of reliability that they measure, and their applicability to different scenarios. We then describe the statistical tests and make additional practical recommendations for reporting results. The metrics and accompanying statistical tools have been made available as an open-source library. We apply our metrics to a set of common RL algorithms and environments, compare them, and analyze the results.",
		"Keywords:": "reinforcement learning, metrics, statistics, reliability",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=SJlpYJBKvH",
		"pdf_link": "https://openreview.net/pdf?id=SJlpYJBKvH",
		"Code:": "https://github.com/google-research/rl-reliability-metrics"
	},
	{
		"title": "Sequential Latent Knowledge Selection for Knowledge-Grounded Dialogue",
		"authors": "Byeongchang Kim,Jaewoo Ahn,Gunhee Kim",
		"emails": "byeongchang.kim@vision.snu.ac.kr, jaewoo.ahn@vision.snu.ac.kr, gunhee@snu.ac.kr",
		"TL;DR:": "Our approach is the first attempt to leverage a sequential latent variable model for knowledge selection in the multi-turn knowledge-grounded dialogue. It achieves the new state-of-the-art performance on Wizard of Wikipedia benchmark.",
		"Abstract:": "Knowledge-grounded dialogue is a task of generating an informative response based on both discourse context and external knowledge. As we focus on better modeling the knowledge selection in the multi-turn knowledge-grounded dialogue, we propose a sequential latent variable model as the first approach to this matter. The model named sequential knowledge transformer (SKT) can keep track of the prior and posterior distribution over knowledge; as a result, it can not only reduce the ambiguity caused from the diversity in knowledge selection of conversation but also better leverage the response information for proper choice of knowledge. Our experimental results show that the proposed model improves the knowledge selection accuracy and subsequently the performance of utterance generation. We achieve the new state-of-the-art performance on Wizard of Wikipedia (Dinan et al., 2019) as one of the most large-scale and challenging benchmarks. We further validate the effectiveness of our model over existing conversation methods in another knowledge-based dialogue Holl-E dataset (Moghe et al., 2018).",
		"Keywords:": "dialogue, knowledge, language, conversation",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=Hke0K1HKwr",
		"pdf_link": "https://openreview.net/pdf?id=Hke0K1HKwr",
		"Code:": "https://github.com/bckim92/sequential-knowledge-transformer"
	},
	{
		"title": "Neural Tangents: Fast and Easy Infinite Neural Networks in Python",
		"authors": "Roman Novak,Lechao Xiao,Jiri Hron,Jaehoon Lee,Alexander A. Alemi,Jascha Sohl-Dickstein,Samuel S. Schoenholz",
		"emails": "romann@google.com, xlc@google.com, jh2084@cam.ac.uk, jaehlee@google.com, alemi@google.com, jaschasd@google.com, schsam@google.com",
		"TL;DR:": "Keras for infinite neural networks.",
		"Abstract:": "Neural Tangents is a library for working with infinite-width neural networks. It provides a high-level API for specifying complex and hierarchical neural network architectures. These networks can then be trained and evaluated either at finite-width as usual or in their infinite-width limit. Infinite-width networks can be trained analytically using exact Bayesian inference or using gradient descent via the Neural Tangent Kernel. Additionally, Neural Tangents provides tools to study gradient descent training dynamics of wide but finite networks in either function space or weight space.\n      \n      The entire library runs out-of-the-box on CPU, GPU, or TPU. All computations can be automatically distributed over multiple accelerators with near-linear scaling in the number of devices. \n      \n      In addition to the repository below, we provide an accompanying interactive Colab notebook athttps://colab.research.google.com/github/google/neural-tangents/blob/master/notebooks/neural_tangents_cookbook.ipynb",
		"Keywords:": "Infinite Neural Networks, Gaussian Processes, Neural Tangent Kernel, NNGP, NTK, Software Library, Python, JAX",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=SklD9yrFPS",
		"pdf_link": "https://openreview.net/pdf?id=SklD9yrFPS",
		"Code:": "https://www.github.com/google/neural-tangents"
	},
	{
		"title": "Self-labelling via simultaneous clustering and representation learning",
		"authors": "Asano YM.,Rupprecht C.,Vedaldi A.",
		"emails": "yuki@robots.ox.ac.uk, chrisr@robots.ox.ac.uk, vedaldi@robots.ox.ac.uk",
		"TL;DR:": "We propose a self-supervised learning formulation that simultaneously learns feature representations and useful dataset labels by optimizing the common cross-entropy loss for features _and_ labels, while maximizing information.",
		"Abstract:": "Combining clustering and representation learning is one of the most promising approaches for unsupervised learning of deep neural networks. However, doing so naively leads to ill posed learning problems with degenerate solutions.\n      In this paper, we propose a novel and principled learning formulation that addresses these issues.\n      The method is obtained by maximizing the information between labels and input data indices.\n      We show that this criterion extends standard cross-entropy minimization to an optimal transport problem, which we solve efficiently for millions of input images and thousands of labels using a fast variant of the Sinkhorn-Knopp algorithm.\n      The resulting method is able to self-label visual data so as to train highly competitive image representations without manual labels. Our method achieves state of the art representation learning performance for AlexNet and ResNet-50 on SVHN, CIFAR-10, CIFAR-100 and ImageNet and yields the first self-supervised AlexNet that outperforms the supervised Pascal VOC detection baseline.",
		"Keywords:": "self-supervision, feature representation learning, clustering",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=Hyx-jyBFPr",
		"pdf_link": "https://openreview.net/pdf?id=Hyx-jyBFPr",
		"Code:": "https://www.github.com/google/neural-tangents"
	},
	{
		"title": "The intriguing role of module criticality in the generalization of deep networks",
		"authors": "Niladri Chatterji,Behnam Neyshabur,Hanie Sedghi",
		"emails": "niladri.chatterji@berkeley.edu, neyshabur@google.com, hsedghi@google.com",
		"TL;DR:": "We study the phenomenon that some modules of DNNs are more critical than others. Our analysis leads us to propose a complexity measure, that is able to explain the superior generalization performance of some architectures over others.",
		"Abstract:": "We study the phenomenon that some modules of deep neural networks (DNNs) are more critical than others. Meaning that rewinding their parameter values back to initialization, while keeping other modules fixed at the trained parameters, results in a large drop in the network's performance. Our analysis reveals interesting properties of the loss landscape which leads us to propose a complexity measure, called module criticality, based on the shape of the valleys that connect the initial and final values of the module parameters. We formulate how generalization relates to the module criticality, and show that this measure is able to explain the superior generalization performance of some architectures over others, whereas, earlier measures fail to do so.",
		"Keywords:": "Module Criticality Phenomenon, Complexity Measure, Deep Learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=S1e4jkSKvB",
		"pdf_link": "https://openreview.net/pdf?id=S1e4jkSKvB",
		"Code:": "https://www.github.com/google/neural-tangents"
	},
	{
		"title": "Harnessing the Power of Infinitely Wide Deep Nets on Small-data Tasks",
		"authors": "Sanjeev Arora,Simon S. Du,Zhiyuan Li,Ruslan Salakhutdinov,Ruosong Wang,Dingli Yu",
		"emails": "arora@cs.princeton.edu, ssdu@ias.edu, zhiyuanli@cs.princeton.edu, rsalakhu@cs.cmu.edu, ruosongw@andrew.cmu.edu, dingliy@cs.princeton.edu",
		"TL;DR:": "We verify neural tangent kernel is powerful on small data via experiments on UCI datasets, small CIFAR 10 and low-shot learning on VOC07.",
		"Abstract:": "Recent research shows that the following two models are equivalent: (a) infinitely wide neural networks (NNs) trained under l2 loss by gradient descent with infinitesimally small learning rate (b) kernel regression with respect to so-called Neural Tangent Kernels (NTKs) (Jacot et al., 2018). An efficient algorithm to compute the NTK, as well as its convolutional counterparts, appears in Arora et al. (2019a), which allowed studying performance of infinitely wide nets on datasets like CIFAR-10. However, super-quadratic running time of kernel methods makes them best suited for small-data tasks. We report results suggesting neural tangent kernels perform strongly on low-data tasks.\n      1. On a standard testbed of classification/regression tasks from the UCI database, NTK SVM beats the previous gold standard, Random Forests (RF), and also the corresponding finite nets.\n      2. On CIFAR-10 with 10 – 640 training samples, Convolutional NTK consistently beats ResNet-34 by 1% - 3%.\n      3. On VOC07 testbed for few-shot image classification tasks on ImageNet with transfer learning (Goyal et al., 2019), replacing the linear SVM currently used with a Convolutional NTK SVM consistently improves performance.\n      4. Comparing the performance of NTK with the finite-width net it was derived from, NTK behavior starts at lower net widths than suggested by theoretical analysis(Arora et al., 2019a). NTK’s efficacy may trace to lower variance of output.",
		"Keywords:": "small data, neural tangent kernel, UCI database, few-shot learning, kernel SVMs, deep learning theory, kernel design",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rkl8sJBYvH",
		"pdf_link": "https://openreview.net/pdf?id=rkl8sJBYvH",
		"Code:": "https://github.com/LeoYu/neural-tangent-kernel-UCI;https://drive.google.com/open?id=1SdgWmhEcnm4qyaM9xrkN01VF9tj40WZS"
	},
	{
		"title": "Differentiation of Blackbox Combinatorial Solvers",
		"authors": "Marin Vlastelica Pogančić,Anselm Paulus,Vit Musil,Georg Martius,Michal Rolinek",
		"emails": "marin.vlastelica@tue.mpg.de, anselm.paulus@tuebingen.mpg.de, vejtek@atrey.karlin.mff.cuni.cz, georg.martius@tuebingen.mpg.de, michal.rolinek@tuebingen.mpg.de",
		"TL;DR:": "In this work, we present a method that implements an efficient backward pass through blackbox implementations of combinatorial solvers with linear objective functions.",
		"Abstract:": "Achieving fusion of deep learning with combinatorial algorithms promises transformative changes to artificial intelligence. One possible approach is to introduce combinatorial building blocks into neural networks. Such end-to-end architectures have the potential to tackle combinatorial problems on raw input data such as ensuring global consistency in multi-object tracking or route planning on maps in robotics. In this work, we present a method that implements an efficient backward pass through blackbox implementations of combinatorial solvers with linear objective functions. We provide both theoretical and experimental backing. In particular, we incorporate the Gurobi MIP solver, Blossom V algorithm, and Dijkstra's algorithm into architectures that extract suitable features from raw inputs for the traveling salesman problem, the min-cost perfect matching problem and the shortest path problem.",
		"Keywords:": "combinatorial algorithms, deep learning, representation learning, optimization",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BkevoJSYPB",
		"pdf_link": "https://openreview.net/pdf?id=BkevoJSYPB",
		"Code:": "https://sites.google.com/view/combinatorialgradients/home"
	},
	{
		"title": "Scaling Autoregressive Video Models",
		"authors": "Dirk Weissenborn,Oscar Täckström,Jakob Uszkoreit",
		"emails": "diwe@google.com, oscar.tackstrom@gmail.com, usz@google.com",
		"TL;DR:": "We present a novel autoregressive video generation that achieves strong results on popular datasets and produces encouraging continuations of real world videos.",
		"Abstract:": "Due to the statistical complexity of video, the high degree of inherent stochasticity, and the sheer amount of data, generating natural video remains a challenging task. State-of-the-art video generation models attempt to address these issues by combining sometimes complex, often video-specific neural network architectures, latent variable models, adversarial training and a range of other methods. Despite their often high complexity, these approaches still fall short of generating high quality video continuations outside of narrow domains and often struggle with fidelity. In contrast, we show that conceptually simple, autoregressive video generation models based on a three-dimensional self-attention mechanism achieve highly competitive results across multiple metrics on popular benchmark datasets for which they produce continuations of high fidelity and realism. Furthermore, we find that our models are capable of producing diverse and surprisingly realistic continuations on a subset of videos from Kinetics, a large scale action recognition dataset comprised of YouTube videos exhibiting phenomena such as camera movement, complex object interactions and diverse human movement. To our knowledge, this is the first promising application of video-generation models to videos of this complexity.",
		"Keywords:": "autoregressive models, video prediction, generative models, video generation",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rJgsskrFwH",
		"pdf_link": "https://openreview.net/pdf?id=rJgsskrFwH",
		"Code:": "https://sites.google.com/view/combinatorialgradients/home"
	},
	{
		"title": "The Ingredients of Real World Robotic Reinforcement Learning",
		"authors": "Henry Zhu,Justin Yu,Abhishek Gupta,Dhruv Shah,Kristian Hartikainen,Avi Singh,Vikash Kumar,Sergey Levine",
		"emails": "henryzhu@berkeley.edu, justinvyu@berkeley.edu, abhigupta@berkeley.edu, shah@eecs.berkeley.edu, kristian.hartikainen@gmail.com, avisingh@cs.berkeley.edu, vikashplus@gmail.com, svlevine@eecs.berkeley.edu",
		"TL;DR:": "System to learn robotic tasks in the real world with reinforcement learning without instrumentation",
		"Abstract:": "The success of reinforcement learning in the real world has been limited to instrumented laboratory scenarios, often requiring arduous human supervision to enable continuous learning. In this work, we discuss the required elements of a robotic system that can continually and autonomously improve with data collected in the real world, and propose a particular instantiation of such a system. Subsequently, we investigate a number of challenges of learning without instrumentation -- including the lack of episodic resets, state estimation, and hand-engineered rewards -- and propose simple, scalable solutions to these challenges. We demonstrate the efficacy of our proposed system on dexterous robotic manipulation tasks in simulation and the real world, and also provide an insightful analysis and ablation study of the challenges associated with this learning paradigm.",
		"Keywords:": "Reinforcement Learning, Robotics",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rJe2syrtvS",
		"pdf_link": "https://openreview.net/pdf?id=rJe2syrtvS",
		"Code:": "https://sites.google.com/view/combinatorialgradients/home"
	},
	{
		"title": "Meta-Learning Acquisition Functions for Transfer Learning in Bayesian Optimization",
		"authors": "Michael Volpp,Lukas P. Fröhlich,Kirsten Fischer,Andreas Doerr,Stefan Falkner,Frank Hutter,Christian Daniel",
		"emails": "mvolpp89@googlemail.com, lukas.froehlich@de.bosch.com, k.fischer-lotte@online.de, andreas.doerr3@de.bosch.com, stefan.falkner@de.bosch.com, fh@cs.uni-freiburg.de, christian.daniel@de.bosch.com",
		"TL;DR:": "We perform efficient and flexible transfer learning in the framework of Bayesian optimization through meta-learned neural acquisition functions.",
		"Abstract:": "Transferring knowledge across tasks to improve data-efficiency is one of the open key challenges in the field of global black-box optimization. Readily available algorithms are typically designed to be universal optimizers and, therefore, often suboptimal for specific tasks. We propose a novel transfer learning method to obtain customized optimizers within the well-established framework of Bayesian optimization, allowing our algorithm to utilize the proven generalization capabilities of Gaussian processes. Using reinforcement learning to meta-train an acquisition function (AF) on a set of related tasks, the proposed method learns to extract implicit structural information and to exploit it for improved data-efficiency. We present experiments on a simulation-to-real transfer task as well as on several synthetic functions and on two hyperparameter search problems. The results show that our algorithm (1) automatically identifies structural properties of objective functions from available source tasks or simulations, (2) performs favourably in settings with both scarse and abundant source data, and (3) falls back to the performance level of general AFs if no particular structure is present.",
		"Keywords:": "Transfer Learning, Meta Learning, Bayesian Optimization, Reinforcement Learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=ryeYpJSKwr",
		"pdf_link": "https://openreview.net/pdf?id=ryeYpJSKwr",
		"Code:": "https://github.com/metabo-iclr2020/MetaBO"
	},
	{
		"title": "Maximum Likelihood Constraint Inference for Inverse Reinforcement Learning",
		"authors": "Dexter R.R. Scobee,S. Shankar Sastry",
		"emails": "dscobee@eecs.berkeley.edu, sastry@eecs.berkeley.edu",
		"TL;DR:": "Our method infers constraints on task execution by leveraging the principle of maximum entropy to quantify how demonstrations differ from expected, un-constrained behavior.",
		"Abstract:": "While most approaches to the problem of Inverse Reinforcement Learning (IRL) focus on estimating a reward function that best explains an expert agent’s policy or demonstrated behavior on a control task, it is often the case that such behavior is more succinctly represented by a simple reward combined with a set of hard constraints. In this setting, the agent is attempting to maximize cumulative rewards subject to these given constraints on their behavior. We reformulate the problem of IRL on Markov Decision Processes (MDPs) such that, given a nominal model of the environment and a nominal reward function, we seek to estimate state, action, and feature constraints in the environment that motivate an agent’s behavior. Our approach is based on the Maximum Entropy IRL framework, which allows us to reason about the likelihood of an expert agent’s demonstrations given our knowledge of an MDP. Using our method, we can infer which constraints can be added to the MDP to most increase the likelihood of observing these demonstrations. We present an algorithm which iteratively infers the Maximum Likelihood Constraint to best explain observed behavior, and we evaluate its efficacy using both simulated behavior and recorded data of humans navigating around an obstacle.",
		"Keywords:": "learning from demonstration, inverse reinforcement learning, constraint inference",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BJliakStvH",
		"pdf_link": "https://openreview.net/pdf?id=BJliakStvH",
		"Code:": "https://drive.google.com/drive/folders/1h2J7o4w4J0_dpldTRpFu_jWQR8CkBbXw"
	},
	{
		"title": "Spectral  Embedding of Regularized Block Models",
		"authors": "Nathan De Lara,Thomas Bonald",
		"emails": "ndelara@enst.fr, bonald@enst.fr",
		"TL;DR:": "Graph regularization forces spectral embedding to focus on the largest clusters, making the representation less sensitive to noise.",
		"Abstract:": "Spectral embedding is a popular technique for the representation of graph data. Several regularization techniques have been proposed to improve the quality of the embedding with respect to downstream tasks like clustering. In this paper, we explain on a simple block model the impact of the complete graph regularization, whereby a constant is added to all entries of the adjacency matrix. Specifically, we show that the regularization forces the spectral embedding  to focus on  the  largest blocks, making the representation less sensitive to noise or outliers. We illustrate these results on both  on both synthetic and real data, showing how regularization improves standard clustering scores.",
		"Keywords:": "Spectral embedding, regularization, block models, clustering",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=H1l_0JBYwS",
		"pdf_link": "https://openreview.net/pdf?id=H1l_0JBYwS",
		"Code:": "https://github.com/nathandelara/Spectral-Embedding-of-Regularized-Block-Models/"
	},
	{
		"title": "Towards Hierarchical Importance Attribution: Explaining Compositional Semantics for Neural Sequence Models",
		"authors": "Xisen Jin,Zhongyu Wei,Junyi Du,Xiangyang Xue,Xiang Ren",
		"emails": "xisenjin@usc.edu, zywei@fudan.edu.cn, junyidu@usc.edu, xyxue@fudan.edu.cn, xiangren@usc.edu",
		"TL;DR:": "We propose measurement of phrase importance and algorithms for hierarchical explanation of neural sequence model predictions",
		"Abstract:": "The impressive performance of neural networks on natural language processing tasks attributes to their ability to model complicated word and phrase compositions. To explain how the model handles semantic compositions, we study hierarchical explanation of neural network predictions. We identify non-additivity and context independent importance attributions within hierarchies as two desirable properties for highlighting word and phrase compositions. We show some prior efforts on hierarchical explanations, e.g. contextual decomposition, do not satisfy the desired properties mathematically, leading to inconsistent explanation quality in different models. In this paper, we start by proposing a formal and general way to quantify the importance of each word and phrase. Following the formulation, we propose Sampling and Contextual Decomposition (SCD) algorithm and Sampling and Occlusion (SOC) algorithm. Human and metrics evaluation on both LSTM models and BERT Transformer models on multiple datasets show that our algorithms outperform prior hierarchical explanation algorithms. Our algorithms help to visualize semantic composition captured by models, extract classification rules and improve human trust of models.",
		"Keywords:": "natural language processing, interpretability",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BkxRRkSKwr",
		"pdf_link": "https://openreview.net/pdf?id=BkxRRkSKwr",
		"Code:": "https://github.com/nathandelara/Spectral-Embedding-of-Regularized-Block-Models/"
	},
	{
		"title": "word2ket: Space-efficient Word Embeddings inspired by Quantum Entanglement",
		"authors": "Aliakbar Panahi,Seyran Saeedi,Tom Arodz",
		"emails": "panahia@vcu.edu, saeedis@vcu.edu, tarodz@vcu.edu",
		"TL;DR:": "We use ideas from quantum computing to propose word embeddings that utilize much fewer trainable parameters.",
		"Abstract:": "Deep learning natural language processing models often use vector word embeddings, such as word2vec or GloVe, to represent words. A discrete sequence of words can be much more easily integrated with downstream neural layers if it is represented as a  sequence of continuous vectors. Also, semantic relationships between words, learned from a text corpus, can be encoded in the relative configurations of the embedding vectors. However, storing and accessing embedding vectors for all words in a dictionary requires large amount of space, and may stain systems with limited GPU memory. Here, we used approaches inspired by quantum computing to propose two related methods, word2ket and word2ketXS, for storing word embedding matrix during training and inference in a highly efficient way. Our approach achieves a hundred-fold or more reduction in the space required to store the embeddings with almost no relative drop in accuracy in practical natural language processing tasks.",
		"Keywords:": "word embeddings, natural language processing, model reduction",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=HkxARkrFwB",
		"pdf_link": "https://openreview.net/pdf?id=HkxARkrFwB",
		"Code:": "https://github.com/panaali/word2ket"
	},
	{
		"title": "What Can Neural Networks Reason About?",
		"authors": "Keyulu Xu,Jingling Li,Mozhi Zhang,Simon S. Du,Ken-ichi Kawarabayashi,Stefanie Jegelka",
		"emails": "keyulu@mit.edu, jingling@cs.umd.edu, mozhi@cs.umd.edu, ssdu@ias.edu, k_keniti@nii.ac.jp, stefje@mit.edu",
		"TL;DR:": "We develop a theoretical framework to characterize what a neural network can learn to reason about.",
		"Abstract:": "Neural networks have succeeded in many reasoning tasks. Empirically, these tasks require specialized network structures, e.g., Graph Neural Networks (GNNs) perform well on many such tasks, but less structured networks fail. Theoretically, there is limited understanding of why and when a network structure generalizes better than others, although they have equal expressive power. In this paper, we develop a framework to characterize which reasoning tasks a network can learn well, by studying how well its computation structure aligns with the algorithmic structure of the relevant reasoning process. We formally define this algorithmic alignment and derive a sample complexity bound that decreases with better alignment. This framework offers an explanation for the empirical success of popular reasoning models, and suggests their limitations. As an example, we unify seemingly different reasoning tasks, such as intuitive physics, visual question answering, and shortest paths, via the lens of a powerful algorithmic paradigm, dynamic programming (DP). We show that GNNs align with DP and thus are expected to solve these tasks. On several reasoning tasks, our theory is supported by empirical results.",
		"Keywords:": "reasoning, deep learning theory, algorithmic alignment, graph neural networks",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rJxbJeHFPS",
		"pdf_link": "https://openreview.net/pdf?id=rJxbJeHFPS",
		"Code:": "https://github.com/NNReasoning/What-Can-Neural-Networks-Reason-About"
	},
	{
		"title": "Training individually fair ML models with sensitive subspace robustness",
		"authors": "Mikhail Yurochkin,Amanda Bower,Yuekai Sun",
		"emails": "mikhail.yurochkin@ibm.com, amandarg@umich.edu, yuekai@umich.edu",
		"TL;DR:": "Algorithm for training individually fair classifier using adversarial robustness",
		"Abstract:": "We consider training machine learning models that are fair in the sense that their performance is invariant under certain sensitive perturbations to the inputs. For example, the performance of a resume screening system should be invariant under changes to the gender and/or ethnicity of the applicant. We formalize this notion of algorithmic fairness as a variant of individual fairness and develop a distributionally robust optimization approach to enforce it during training. We also demonstrate the effectiveness of the approach on two ML tasks that are susceptible to gender and racial biases.",
		"Keywords:": "fairness, adversarial robustness",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=B1gdkxHFDH",
		"pdf_link": "https://openreview.net/pdf?id=B1gdkxHFDH",
		"Code:": "https://github.com/IBM/sensitive-subspace-robustness"
	},
	{
		"title": "Learning from Rules Generalizing Labeled Exemplars",
		"authors": "Abhijeet Awasthi,Sabyasachi Ghosh,Rasna Goyal,Sunita Sarawagi",
		"emails": "awasthi@cse.iitb.ac.in, sunita@iitb.ac.in, sghosh@cse.iitb.ac.in, rasna.goyal66@gmail.com",
		"TL;DR:": "Coupled rule-exemplar supervision and a implication loss helps to jointly learn to denoise rules and imply labels.",
		"Abstract:": "In many applications labeled data  is not readily available, and needs to be collected via pain-staking human supervision.\n      We propose a rule-exemplar method for collecting human supervision to combine the efficiency of rules with the quality of instance labels.  The supervision is coupled such that it is both natural for humans and synergistic for learning.\n      We propose a training algorithm that jointly denoises rules via latent coverage variables, and trains the model through a soft implication loss over the coverage and label variables.  The denoised rules and trained model are used jointly for inference.\n      Empirical evaluation on five different tasks shows that (1) our algorithm is more accurate than several existing methods of learning from a mix of clean and noisy supervision, and (2)  the coupled rule-exemplar supervision is effective in denoising rules.",
		"Keywords:": "Learning from Rules, Learning from limited labeled data, Weakly Supervised Learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=SkeuexBtDr",
		"pdf_link": "https://openreview.net/pdf?id=SkeuexBtDr",
		"Code:": "https://github.com/awasthiabhijeet/Learning-From-Rules"
	},
	{
		"title": "Directional Message Passing for Molecular Graphs",
		"authors": "Johannes Klicpera,Janek Groß,Stephan Günnemann",
		"emails": "klicpera@in.tum.de, grossja@in.tum.de, guennemann@in.tum.de",
		"TL;DR:": "Directional message passing incorporates spatial directional information to improve graph neural networks.",
		"Abstract:": "Graph neural networks have recently achieved great successes in predicting quantum mechanical properties of molecules. These models represent a molecule as a graph using only the distance between atoms (nodes). They do not, however, consider the spatial direction from one atom to another, despite directional information playing a central role in empirical potentials for molecules, e.g. in angular potentials. To alleviate this limitation we propose directional message passing, in which we embed the messages passed between atoms instead of the atoms themselves. Each message is associated with a direction in coordinate space. These directional message embeddings are rotationally equivariant since the associated directions rotate with the molecule. We propose a message passing scheme analogous to belief propagation, which uses the directional information by transforming messages based on the angle between them. Additionally, we use spherical Bessel functions and spherical harmonics to construct theoretically well-founded, orthogonal representations that achieve better performance than the currently prevalent Gaussian radial basis representations while using fewer than 1/4 of the parameters. We leverage these innovations to construct the directional message passing neural network (DimeNet). DimeNet outperforms previous GNNs on average by 76% on MD17 and by 31% on QM9. Our implementation is available online.",
		"Keywords:": "GNN, Graph neural network, message passing, graphs, equivariance, molecules",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=B1eWbxStPH",
		"pdf_link": "https://openreview.net/pdf?id=B1eWbxStPH",
		"Code:": "https://www.daml.in.tum.de/dimenet"
	},
	{
		"title": "Explanation  by Progressive  Exaggeration",
		"authors": "Sumedha Singla,Brian Pollack,Junxiang Chen,Kayhan Batmanghelich",
		"emails": "sumedha.singla@pitt.edu, kayhan@pitt.edu, cjx880409@gmail.com, kayhan@pitt.edu",
		"TL;DR:": "A method to explain a classifier, by generating visual perturbation of an image by exaggerating  or diminishing the semantic features that the classifier associates with a target label.",
		"Abstract:": "As machine learning methods see greater adoption and implementation in high stakes applications such as medical image diagnosis, the need for model interpretability and explanation has become more critical. Classical approaches that assess feature importance (eg saliency maps) do not explain how and why a particular region of an image is relevant to the prediction. We propose a method that explains the outcome of a classification black-box by gradually exaggerating the semantic effect of a given class. Given a query input to a classifier, our method produces a progressive set of plausible variations of that query, which gradually change the posterior probability from its original class to its negation. These counter-factually generated samples preserve features unrelated to the classification decision, such that a user can employ our method as a ``tuning knob'' to traverse a data manifold while crossing the decision boundary.  Our method is model agnostic and only requires the output value and gradient of the predictor with respect to its input.",
		"Keywords:": "Explain, deep learning, black box, GAN, counterfactual",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=H1xFWgrFPS",
		"pdf_link": "https://openreview.net/pdf?id=H1xFWgrFPS",
		"Code:": "https://github.com/batmanlab/Explanation_by_Progressive_Exaggeration.git"
	},
	{
		"title": "Compression based bound for non-compressed network: unified generalization error analysis of large compressible deep neural network",
		"authors": "Taiji Suzuki,Hiroshi Abe,Tomoaki Nishimura",
		"emails": "taiji@mist.i.u-tokyo.ac.jp, abe@ipride.co.jp, tomoaki.nishimura@nttdata.com",
		"TL;DR:": "A method to explain a classifier, by generating visual perturbation of an image by exaggerating  or diminishing the semantic features that the classifier associates with a target label.",
		"Abstract:": "One of the biggest issues in deep learning theory is the generalization ability of networks with huge model size. \n      The classical learning theory suggests that overparameterized models cause overfitting.\n      However, practically used large deep models avoid overfitting, which is not well explained by the classical approaches.\n      To resolve this issue, several attempts have been made. \n      Among them, the compression based bound is one of the promising approaches. \n      However, the compression based bound can be applied only to a compressed network, and it is not applicable to the non-compressed original network. \n      In this paper, we give a unified frame-work that can convert compression based bounds to those for non-compressed original networks.\n      The bound gives even better rate than the one for the compressed network by improving the bias term.\n      By establishing the unified frame-work, we can obtain a data dependent generalization error bound which gives a tighter evaluation than the data independent ones.",
		"Keywords:": "Generalization error, compression based bound, local Rademacher complexity",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=ByeGzlrKwH",
		"pdf_link": "https://openreview.net/pdf?id=ByeGzlrKwH",
		"Code:": "https://github.com/batmanlab/Explanation_by_Progressive_Exaggeration.git"
	},
	{
		"title": "At Stability's Edge: How to Adjust Hyperparameters to Preserve Minima Selection in Asynchronous Training of Neural Networks?",
		"authors": "Niv Giladi,Mor Shpigel Nacson,Elad Hoffer,Daniel Soudry",
		"emails": "giladiniv@gmail.com, mor.shpigel@gmail.com, elad.hoffer@gmail.com, daniel.soudry@gmail.com",
		"TL;DR:": "How to prevent stale gradients (in asynchronous SGD) from changing minima stability and degrade steady state generalization?",
		"Abstract:": "Background: Recent developments have made it possible to accelerate neural networks training significantly using large batch sizes and data parallelism. Training in an asynchronous fashion, where delay occurs, can make training even more scalable. However, asynchronous training has its pitfalls, mainly a degradation in generalization, even after convergence of the algorithm. This gap remains not well understood, as theoretical analysis so far mainly focused on the convergence rate of asynchronous methods.\n      Contributions: We examine asynchronous training from the perspective of dynamical stability. We find that the degree of delay interacts with the learning rate, to change the set of minima accessible by an asynchronous stochastic gradient descent algorithm. We derive closed-form rules on how the learning rate could be changed, while keeping the accessible set the same. Specifically, for high delay values, we find that the learning rate should be kept inversely proportional to the delay. We then extend this analysis to include momentum. We find momentum should be either turned off, or modified to improve training stability.  We provide empirical experiments to validate our theoretical findings.",
		"Keywords:": "implicit bias, stability, neural networks, generalization gap, asynchronous SGD",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=Bkeb7lHtvH",
		"pdf_link": "https://openreview.net/pdf?id=Bkeb7lHtvH",
		"Code:": "https://github.com/paper-submissions/delay_stability"
	},
	{
		"title": "Disentanglement by Nonlinear ICA with General Incompressible-flow Networks (GIN)",
		"authors": "Peter Sorrenson,Carsten Rother,Ullrich Köthe",
		"emails": "peter.sorrenson@gmail.com, carsten.rother@iwr.uni-heidelberg.de, ullrich.koethe@iwr.uni-heidelberg.de",
		"TL;DR:": "How to prevent stale gradients (in asynchronous SGD) from changing minima stability and degrade steady state generalization?",
		"Abstract:": "A central question of representation learning asks under which conditions it is possible to reconstruct the true latent variables of an arbitrarily complex generative process. Recent breakthrough work by Khemakhem et al. (2019) on nonlinear ICA has answered this question for a broad class of conditional generative processes. We extend this important result in a direction relevant for application to real-world data. First, we generalize the theory to the case of unknown intrinsic problem dimension and prove that in some special (but not very restrictive) cases, informative latent variables will be automatically separated from noise by an estimating model. Furthermore, the recovered informative latent variables will be in one-to-one correspondence with the true latent variables of the generating process, up to a trivial component-wise transformation. Second, we introduce a modification of the RealNVP invertible neural network architecture (Dinh et al. (2016)) which is particularly suitable for this type of problem: the General Incompressible-flow Network (GIN). Experiments on artificial data and EMNIST demonstrate that theoretical predictions are indeed verified in practice. In particular, we provide a detailed set of exactly 22 informative latent variables extracted from EMNIST.",
		"Keywords:": "disentanglement, nonlinear ICA, representation learning, feature discovery, theoretical justification",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rygeHgSFDH",
		"pdf_link": "https://openreview.net/pdf?id=rygeHgSFDH",
		"Code:": "https://github.com/paper-submissions/delay_stability"
	},
	{
		"title": "Kaleidoscope: An Efficient, Learnable Representation For All Structured Linear Maps",
		"authors": "Tri Dao,Nimit Sohoni,Albert Gu,Matthew Eichhorn,Amit Blonder,Megan Leszczynski,Atri Rudra,Christopher Ré",
		"emails": "trid@stanford.edu, nims@stanford.edu, albertgu@stanford.edu, mae226@cornell.edu, amitblon@buffalo.edu, mleszczy@stanford.edu, atri@buffalo.edu, chrismre@cs.stanford.edu",
		"TL;DR:": "We propose a differentiable family of \"kaleidoscope matrices,\" prove that all structured matrices can be represented in this form, and use them to replace hand-crafted linear maps in deep learning models.",
		"Abstract:": "Modern neural network architectures use structured linear transformations, such as low-rank matrices, sparse matrices, permutations, and the Fourier transform, to improve inference speed and reduce memory usage compared to general linear maps. However, choosing which of the myriad structured transformations to use (and its associated parameterization) is a laborious task that requires trading off speed, space, and accuracy. We consider a different approach: we introduce a family of matrices called kaleidoscope matrices (K-matrices) that provably capture any structured matrix with near-optimal space (parameter) and time (arithmetic operation) complexity. We empirically validate that K-matrices can be automatically learned within end-to-end pipelines to replace hand-crafted procedures, in order to improve model quality. For example, replacing channel shuffles in ShuffleNet improves classification accuracy on ImageNet by up to 5%. K-matrices can also simplify hand-engineered pipelines---we replace filter bank feature computation in speech data preprocessing with a learnable kaleidoscope layer, resulting in only 0.4% loss in accuracy on the TIMIT speech recognition task. In addition, K-matrices can capture latent structure in models: for a challenging permuted image classification task, adding a K-matrix to a standard convolutional architecture can enable learning the latent permutation and improve accuracy by over 8 points. We provide a practically efficient implementation of our approach, and use K-matrices in a Transformer network to attain 36% faster end-to-end inference speed on a language translation task.",
		"Keywords:": "structured matrices, efficient ML, algorithms, butterfly matrices, arithmetic circuits",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BkgrBgSYDS",
		"pdf_link": "https://openreview.net/pdf?id=BkgrBgSYDS",
		"Code:": "https://github.com/HazyResearch/learning-circuits"
	},
	{
		"title": "Improving Generalization in Meta Reinforcement Learning using Learned Objectives",
		"authors": "Louis Kirsch,Sjoerd van Steenkiste,Juergen Schmidhuber",
		"emails": "louis@idsia.ch, sjoerd@idsia.ch, juergen@idsia.ch",
		"TL;DR:": "We introduce MetaGenRL, a novel meta reinforcement learning algorithm. Unlike prior work, MetaGenRL can generalize to new environments that are entirely different from those used for meta-training.",
		"Abstract:": "Biological evolution has distilled the experiences of many learners into the general learning algorithms of humans. Our novel meta reinforcement learning algorithm MetaGenRL is inspired by this process. MetaGenRL distills the experiences of many complex agents to meta-learn a low-complexity neural objective function that decides how future individuals will learn. Unlike recent meta-RL algorithms, MetaGenRL can generalize to new environments that are entirely different from those used for meta-training. In some cases, it even outperforms human-engineered RL algorithms. MetaGenRL uses off-policy second-order gradients during meta-training that greatly increase its sample efficiency.",
		"Keywords:": "meta reinforcement learning, meta learning, reinforcement learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=S1evHerYPr",
		"pdf_link": "https://openreview.net/pdf?id=S1evHerYPr",
		"Code:": "https://github.com/HazyResearch/learning-circuits"
	},
	{
		"title": "Drawing Early-Bird Tickets: Toward More Efficient Training of Deep Networks",
		"authors": "Haoran You,Chaojian Li,Pengfei Xu,Yonggan Fu,Yue Wang,Xiaohan Chen,Richard G. Baraniuk,Zhangyang Wang,Yingyan Lin",
		"emails": "hy34@rice.edu, cl114@rice.edu, px5@rice.edu, yf22@rice.edu, yw68@rice.edu, chernxh@tamu.edu, richb@rice.edu, atlaswang@tamu.edu, yingyan.lin@rice.edu",
		"TL;DR:": "We introduce MetaGenRL, a novel meta reinforcement learning algorithm. Unlike prior work, MetaGenRL can generalize to new environments that are entirely different from those used for meta-training.",
		"Abstract:": "(Frankle & Carbin, 2019) shows that there exist winning tickets (small but critical subnetworks) for dense, randomly initialized networks, that can be trained alone to achieve comparable accuracies to the latter in a similar number of iterations. However, the identification of these winning tickets still requires the costly train-prune-retrain process, limiting their practical benefits. In this paper, we discover for the first time that the winning tickets can be identified at the very early training stage, which we term as Early-Bird (EB) tickets, via low-cost training schemes (e.g., early stopping and low-precision training) at large learning rates. Our finding of EB tickets is consistent with recently reported observations that the key connectivity patterns of neural networks emerge early. Furthermore, we propose a mask distance metric that can be used to identify EB tickets with low computational overhead, without needing to know the true winning tickets that emerge after the full training. Finally, we leverage the existence of EB tickets and the proposed mask distance to develop efficient training methods, which are achieved by first identifying EB tickets via low-cost schemes, and then continuing to train merely the EB tickets towards the target accuracy. Experiments based on various deep networks and datasets validate: 1) the existence of EB tickets, and the effectiveness of mask distance in efficiently identifying them; and 2) that the proposed efficient training via EB tickets can achieve up to 4.7x energy savings while maintaining comparable or even better accuracy, demonstrating a promising and easily adopted method for tackling cost-prohibitive deep network training.",
		"Keywords:": "meta reinforcement learning, meta learning, reinforcement learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BJxsrgStvr",
		"pdf_link": "https://openreview.net/pdf?id=BJxsrgStvr",
		"Code:": "https://github.com/RICE-EIC/Early-Bird-Tickets"
	},
	{
		"title": "Truth or backpropaganda? An empirical investigation of deep learning theory",
		"authors": "Micah Goldblum,Jonas Geiping,Avi Schwarzschild,Michael Moeller,Tom Goldstein",
		"emails": "goldblumcello@gmail.com, jonas.geiping@uni-siegen.de, avi1@umd.edu, michael.moeller@uni-siegen.de, tomg@cs.umd.edu",
		"TL;DR:": "We call into question commonly held beliefs regarding the loss landscape, optimization, network width, and rank.",
		"Abstract:": "We empirically evaluate common assumptions about neural networks that are widely held by practitioners and theorists alike.  In this work, we: (1) prove the widespread existence of suboptimal local minima in the loss landscape of neural networks, and we use our theory to find examples; (2) show that small-norm parameters are not optimal for generalization; (3) demonstrate that ResNets do not conform to wide-network theories, such as the neural tangent kernel, and that the interaction between skip connections and batch normalization plays a role;  (4) find that rank does not correlate with generalization or robustness in a practical setting.",
		"Keywords:": "Deep learning, generalization, loss landscape, robustness",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=HyxyIgHFvr",
		"pdf_link": "https://openreview.net/pdf?id=HyxyIgHFvr",
		"Code:": "https://github.com/goldblum/TruthOrBackpropaganda"
	},
	{
		"title": "Neural Arithmetic Units",
		"authors": "Andreas Madsen,Alexander Rosenberg Johansen",
		"emails": "amwebdk@gmail.com, alexander@herhjemme.dk",
		"TL;DR:": "We call into question commonly held beliefs regarding the loss landscape, optimization, network width, and rank.",
		"Abstract:": "Neural networks can approximate complex functions, but they struggle to perform exact arithmetic operations over real numbers. The lack of inductive bias for arithmetic operations leaves neural networks without the underlying logic necessary to extrapolate on tasks such as addition, subtraction, and multiplication. We present two new neural network components: the Neural Addition Unit (NAU), which can learn exact addition and subtraction; and the Neural Multiplication Unit (NMU) that can multiply subsets of a vector. The NMU is, to our knowledge, the first arithmetic neural network component that can learn to multiply elements from a vector, when the hidden size is large. The two new components draw inspiration from a theoretical analysis of recently proposed arithmetic components. We find that careful initialization, restricting parameter space, and regularizing for sparsity is important when optimizing the NAU and NMU. Our proposed units NAU and NMU, compared with previous neural units, converge more consistently, have fewer parameters, learn faster, can converge for larger hidden sizes, obtain sparse and meaningful weights, and can extrapolate to negative and small values.",
		"Keywords:": "Deep learning, generalization, loss landscape, robustness",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=H1gNOeHKPS",
		"pdf_link": "https://openreview.net/pdf?id=H1gNOeHKPS",
		"Code:": "https://github.com/AndreasMadsen/stable-nalu"
	},
	{
		"title": "DeepSphere: a graph-based spherical CNN",
		"authors": "Michaël Defferrard,Martino Milani,Frédérick Gusset,Nathanaël Perraudin",
		"emails": "michael.defferrard@epfl.ch, martino.milani@epfl.ch, frederick.gusset@epfl.ch, nathanael.perraudin@sdsc.ethz.ch",
		"TL;DR:": "A graph-based spherical CNN that strikes an interesting balance of trade-offs for a wide variety of applications.",
		"Abstract:": "Designing a convolution for a spherical neural network requires a delicate tradeoff between efficiency and rotation equivariance. DeepSphere, a method based on a graph representation of the discretized sphere, strikes a controllable balance between these two desiderata. This contribution is twofold. First, we study both theoretically and empirically how equivariance is affected by the underlying graph with respect to the number of pixels and neighbors. Second, we evaluate DeepSphere on relevant problems. Experiments show state-of-the-art performance and demonstrates the efficiency and flexibility of this formulation. Perhaps surprisingly, comparison with previous work suggests that anisotropic filters might be an unnecessary price to pay. Our code is available athttps://github.com/deepsphere.",
		"Keywords:": "spherical cnns, graph neural networks, geometric deep learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=B1e3OlStPB",
		"pdf_link": "https://openreview.net/pdf?id=B1e3OlStPB",
		"Code:": "https://github.com/deepsphere"
	},
	{
		"title": "SUMO: Unbiased Estimation of Log Marginal Probability for Latent Variable Models",
		"authors": "Yucen Luo,Alex Beatson,Mohammad Norouzi,Jun Zhu,David Duvenaud,Ryan P. Adams,Ricky T. Q. Chen",
		"emails": "luoyc15@mails.tsinghua.edu.cn, abeatson@cs.princeton.edu, mnorouzi@google.com, dcszj@mail.tsinghua.edu.cn, duvenaud@cs.toronto.edu, rpa@princeton.edu, rtqichen@cs.toronto.edu",
		"TL;DR:": "We create an unbiased estimator for the log probability of latent variable models, extending such models to a larger scope of applications.",
		"Abstract:": "Standard variational lower bounds used to train latent variable models produce biased estimates of most quantities of interest. We introduce an unbiased estimator of the log marginal likelihood and its gradients for latent variable models based on randomized truncation of infinite series. If parameterized by an encoder-decoder architecture, the parameters of the encoder can be optimized to minimize its variance of this estimator. We show that models trained using our estimator give better test-set likelihoods than a standard importance-sampling based approach for the same average computational cost. This estimator also allows use of latent variable models for tasks where unbiased estimators, rather than marginal likelihood lower bounds, are preferred, such as minimizing reverse KL divergences and estimating score functions.",
		"Keywords:": "spherical cnns, graph neural networks, geometric deep learning",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=SylkYeHtwr",
		"pdf_link": "https://openreview.net/pdf?id=SylkYeHtwr",
		"Code:": "https://github.com/deepsphere"
	},
	{
		"title": "Deep Learning For Symbolic Mathematics",
		"authors": "Guillaume Lample,François Charton",
		"emails": "guillaume.lample@gmail.com, fcharton@fb.com",
		"TL;DR:": "We train a neural network to compute function integrals, and to solve complex differential equations.",
		"Abstract:": "Neural networks have a reputation for being better at solving statistical or approximate problems than at performing calculations or working with symbolic data. In this paper, we show that they can be surprisingly good at more elaborated tasks in mathematics, such as symbolic integration and solving differential equations. We propose a syntax for representing these mathematical problems, and methods for generating large datasets that can be used to train sequence-to-sequence models. We achieve results that outperform commercial Computer Algebra Systems such as Matlab or Mathematica.",
		"Keywords:": "symbolic, math, deep learning, transformers",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=S1eZYeHFDS",
		"pdf_link": "https://openreview.net/pdf?id=S1eZYeHFDS",
		"Code:": "https://github.com/deepsphere"
	},
	{
		"title": "Making Sense of Reinforcement Learning and Probabilistic Inference",
		"authors": "Brendan O'Donoghue,Ian Osband,Catalin Ionescu",
		"emails": "bodonoghue85@gmail.com, iosband@google.com, cdi@google.com",
		"TL;DR:": "Popular algorithms that cast \"RL as Inference\" ignore the role of uncertainty and exploration. We highlight the importance of these issues and present a coherent framework for RL and inference that handles them gracefully.",
		"Abstract:": "Reinforcement learning (RL) combines a control problem with statistical estimation: The system dynamics are not known to the agent, but can be learned through experience. A recent line of research casts ‘RL as inference’ and suggests a particular framework to generalize the RL problem as probabilistic inference. Our paper surfaces a key shortcoming in that approach, and clarifies the sense in which RL can be coherently cast as an inference problem. In particular, an RL agent must consider the effects of its actions upon future rewards and observations: The exploration-exploitation tradeoff. In all but the most simple settings, the resulting inference is computationally intractable so that practical RL algorithms must resort to approximation. We demonstrate that the popular ‘RL as inference’ approximation can perform poorly in even very basic problems. However, we show that with a small modification the framework does yield algorithms that can provably perform well, and we show that the resulting algorithm is equivalent to the recently proposed K-learning, which we further connect with Thompson sampling.",
		"Keywords:": "Reinforcement learning, Bayesian inference, Exploration",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=S1xitgHtvS",
		"pdf_link": "https://openreview.net/pdf?id=S1xitgHtvS",
		"Code:": "https://github.com/deepsphere"
	},
	{
		"title": "Unbiased Contrastive Divergence Algorithm for Training Energy-Based Latent Variable Models",
		"authors": "Yixuan Qiu,Lingsong Zhang,Xiao Wang",
		"emails": "yixuanq@andrew.cmu.edu, lingsong@purdue.edu, wangxiao@purdue.edu",
		"TL;DR:": "We have developed a new training algorithm for energy-based latent variable models that completely removes the bias of contrastive divergence.",
		"Abstract:": "The contrastive divergence algorithm is a popular approach to training energy-based latent variable models, which has been widely used in many machine learning models such as the restricted Boltzmann machines and deep belief nets. Despite its empirical success, the contrastive divergence algorithm is also known to have biases that severely affect its convergence. In this article we propose an unbiased version of the contrastive divergence algorithm that completely removes its bias in stochastic gradient methods, based on recent advances on unbiased Markov chain Monte Carlo methods. Rigorous theoretical analysis is developed to justify the proposed algorithm, and numerical experiments show that it significantly improves the existing method. Our findings suggest that the unbiased contrastive divergence algorithm is a promising approach to training general energy-based latent variable models.",
		"Keywords:": "energy model, restricted Boltzmann machine, contrastive divergence, unbiased Markov chain Monte Carlo, distribution coupling",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=r1eyceSYPr",
		"pdf_link": "https://openreview.net/pdf?id=r1eyceSYPr",
		"Code:": "https://github.com/deepsphere"
	},
	{
		"title": "A Mutual Information Maximization Perspective of Language Representation Learning",
		"authors": "Lingpeng Kong,Cyprien de Masson d'Autume,Lei Yu,Wang Ling,Zihang Dai,Dani Yogatama",
		"emails": "lingpenk@google.com, cyprien@google.com, leiyu@google.com, lingwang@google.com, zihangd@google.com, dyogatama@google.com",
		"TL;DR:": "We have developed a new training algorithm for energy-based latent variable models that completely removes the bias of contrastive divergence.",
		"Abstract:": "We show state-of-the-art word representation learning methods maximize an objective function that is a lower bound on the mutual information between different parts of a word sequence (i.e., a sentence). Our formulation provides an alternative perspective that unifies classical word embedding models (e.g., Skip-gram) and modern contextual embeddings (e.g., BERT, XLNet). In addition to enhancing our theoretical understanding of these methods, our derivation leads to a principled framework that can be used to construct new self-supervised tasks. We provide an example by drawing inspirations from related methods based on mutual information maximization that have been successful in computer vision, and introduce a simple self-supervised objective that maximizes the mutual information between a global sentence representation and n-grams in the sentence. Our analysis offers a holistic view of representation learning methods to transfer knowledge and translate progress across multiple domains (e.g., natural language processing, computer vision, audio processing).",
		"Keywords:": "energy model, restricted Boltzmann machine, contrastive divergence, unbiased Markov chain Monte Carlo, distribution coupling",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=Syx79eBKwr",
		"pdf_link": "https://openreview.net/pdf?id=Syx79eBKwr",
		"Code:": "https://github.com/deepsphere"
	},
	{
		"title": "Energy-based models for atomic-resolution protein conformations",
		"authors": "Yilun Du,Joshua Meier,Jerry Ma,Rob Fergus,Alexander Rives",
		"emails": "yilundu@mit.edu, jmeier@fb.com, maj@fb.com, robfergus@fb.com, arives@cs.nyu.edu",
		"TL;DR:": "Energy-based models trained on crystallized protein structures predict native side chain configurations and automatically discover molecular energy features.",
		"Abstract:": "We propose an energy-based model (EBM) of protein conformations that operates at atomic scale. The model is trained solely on crystallized protein data. By contrast, existing approaches for scoring conformations use energy functions that incorporate knowledge of physical principles and features that are the complex product of several decades of research and tuning. To evaluate the model, we benchmark on the rotamer recovery task, the problem of predicting the conformation of a side chain from its context within a protein structure, which has been used to evaluate energy functions for protein design. The model achieves performance close to that of the Rosetta energy function, a state-of-the-art method widely used in protein structure prediction and design. An investigation of the model’s outputs and hidden representations finds that it captures physicochemical properties relevant to protein energy.",
		"Keywords:": "energy-based model, transformer, energy function, protein conformation",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=S1e_9xrFvS",
		"pdf_link": "https://openreview.net/pdf?id=S1e_9xrFvS",
		"Code:": "https://github.com/facebookresearch/protein-ebm"
	},
	{
		"title": "Depth-Width Trade-offs for ReLU Networks via Sharkovsky's Theorem",
		"authors": "Vaggos Chatziafratis,Sai Ganesh Nagarajan,Ioannis Panageas,Xiao Wang",
		"emails": "vaggos@cs.stanford.edu, sai_nagarajan@mymail.sutd.edu.sg, ioannis@sutd.edu.sg, xiao_wang@sutd.edu.sg",
		"TL;DR:": "In this work, we point to a new connection between DNNs expressivity and Sharkovsky’s Theorem from dynamical systems, that enables us to characterize the depth-width trade-offs of ReLU networks",
		"Abstract:": "Understanding the representational power of Deep Neural Networks (DNNs) and how their structural properties (e.g., depth, width, type of activation unit) affect the functions they can compute, has been an important yet challenging question in deep learning and approximation theory. In a seminal paper, Telgarsky high- lighted the benefits of depth by presenting a family of functions (based on sim- ple triangular waves) for which DNNs achieve zero classification error, whereas shallow networks with fewer than exponentially many nodes incur constant error. Even though Telgarsky’s work reveals the limitations of shallow neural networks, it doesn’t inform us on why these functions are difficult to represent and in fact he states it as a tantalizing open question to characterize those functions that cannot be well-approximated by smaller depths.\n      In this work, we point to a new connection between DNNs expressivity and Sharkovsky’s Theorem from dynamical systems, that enables us to characterize the depth-width trade-offs of ReLU networks for representing functions based on the presence of a generalized notion of fixed points, called periodic points (a fixed point is a point of period 1). Motivated by our observation that the triangle waves used in Telgarsky’s work contain points of period 3 – a period that is special in that it implies chaotic behaviour based on the celebrated result by Li-Yorke – we proceed to give general lower bounds for the width needed to represent periodic functions as a function of the depth. Technically, the crux of our approach is based on an eigenvalue analysis of the dynamical systems associated with such functions.",
		"Keywords:": "Depth-Width trade-offs, ReLU networks, chaos theory, Sharkovsky Theorem, dynamical systems",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=BJe55gBtvH",
		"pdf_link": "https://openreview.net/pdf?id=BJe55gBtvH",
		"Code:": "https://docs.google.com/document/d/1qr-sROZ7q93OhigF6CoPde5NQ901wI17wmnBvbZRT9s/edit?fbclid=IwAR1HwkNZ1g2QgMmTGRZ0ktCYNgeKKk91tvRNLb59QJwU3dRmuGCJbTNMwj0"
	},
	{
		"title": "Generalization of Two-layer Neural Networks: An Asymptotic Viewpoint",
		"authors": "Jimmy Ba,Murat Erdogdu,Taiji Suzuki,Denny Wu,Tianzong Zhang",
		"emails": "jba@cs.toronto.edu, erdogdu@cs.toronto.edu, taiji@mist.i.u-tokyo.ac.jp, dennywu@cs.toronto.edu, ztz16@mails.tsinghua.edu.cn",
		"TL;DR:": "Derived population risk of two-layer neural networks in high dimensions and examined presence / absence of  \"double descent\".",
		"Abstract:": "This paper investigates the generalization properties of two-layer neural networks in high-dimensions, i.e. when the number of samples $n$, features $d$, and neurons $h$ tend to infinity at the same rate. Specifically, we derive the exact population risk of the unregularized least squares regression problem with two-layer neural networks when either the first or the second layer is trained using a gradient flow under different initialization setups.  When only the second layer coefficients are optimized, we recover the \\textit{double descent} phenomenon: a cusp in the population risk appears at $h\\approx n$ and further overparameterization decreases the risk. In contrast, when the first layer weights are optimized, we highlight how different scales of initialization lead to different inductive bias, and show that the resulting risk is \\textit{independent} of overparameterization. Our theoretical and experimental results suggest that previously studied model setups that provably give rise to \\textit{double descent} might not translate to optimizing two-layer neural networks.",
		"Keywords:": "Neural Networks, Generalization, High-dimensional Statistics",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=H1gBsgBYwH",
		"pdf_link": "https://openreview.net/pdf?id=H1gBsgBYwH",
		"Code:": "https://docs.google.com/document/d/1qr-sROZ7q93OhigF6CoPde5NQ901wI17wmnBvbZRT9s/edit?fbclid=IwAR1HwkNZ1g2QgMmTGRZ0ktCYNgeKKk91tvRNLb59QJwU3dRmuGCJbTNMwj0"
	},
	{
		"title": "Reconstructing continuous distributions of 3D protein structure from cryo-EM images",
		"authors": "Ellen D. Zhong,Tristan Bepler,Joseph H. Davis,Bonnie Berger",
		"emails": "zhonge@mit.edu, tbepler@mit.edu, jhdavis@mit.edu, bab@mit.edu",
		"TL;DR:": "We propose a deep generative model of volumes for 3D cryo-EM reconstruction from unlabelled 2D images and show that it can learn can learn continuous deformations in protein structure.",
		"Abstract:": "Cryo-electron microscopy (cryo-EM) is a powerful technique for determining the structure of proteins and other macromolecular complexes at near-atomic resolution. In single particle cryo-EM, the central problem is to reconstruct the 3D structure of a macromolecule from $10^{4-7}$ noisy and randomly oriented 2D projection images. However, the imaged protein complexes may exhibit structural variability, which complicates reconstruction and is typically addressed using discrete clustering approaches that fail to capture the full range of protein dynamics. Here, we introduce a novel method for cryo-EM reconstruction that extends naturally to modeling continuous generative factors of structural heterogeneity. This method encodes structures in Fourier space using coordinate-based deep neural networks, and trains these networks from unlabeled 2D cryo-EM images by combining exact inference over image orientation with variational inference for structural heterogeneity. We demonstrate that the proposed method, termed cryoDRGN, can perform ab-initio reconstruction of 3D protein complexes from simulated and real 2D cryo-EM image data. To our knowledge, cryoDRGN is the first neural network-based approach for cryo-EM reconstruction and the first end-to-end method for directly reconstructing continuous ensembles of protein structures from cryo-EM images.",
		"Keywords:": "generative models, proteins, 3D reconstruction, cryo-EM",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=SJxUjlBtwB",
		"pdf_link": "https://openreview.net/pdf?id=SJxUjlBtwB",
		"Code:": "https://docs.google.com/document/d/1qr-sROZ7q93OhigF6CoPde5NQ901wI17wmnBvbZRT9s/edit?fbclid=IwAR1HwkNZ1g2QgMmTGRZ0ktCYNgeKKk91tvRNLb59QJwU3dRmuGCJbTNMwj0"
	},
	{
		"title": "PROGRESSIVE LEARNING AND DISENTANGLEMENT OF HIERARCHICAL REPRESENTATIONS",
		"authors": "Zhiyuan Li,Jaideep Vitthal Murkute,Prashnna Kumar Gyawali,Linwei Wang",
		"emails": "zl7904@rit.edu, jvm6526@rit.edu, pkg2182@rit.edu, linwei.wang@rit.edu",
		"TL;DR:": "We proposed a progressive learning method to improve learning and disentangling latent representations at different levels of abstraction.",
		"Abstract:": "Learning rich representation from data is an important task for deep generative models such as variational auto-encoder (VAE). However, by extracting high-level abstractions in the bottom-up inference process, the goal of preserving all factors of variations for top-down generation is compromised. Motivated by the concept of “starting small”, we present a strategy to progressively learn independent hierarchical representations from high- to low-levels of abstractions. The model starts with learning the most abstract representation, and then progressively grow the network architecture to introduce new  representations at different levels of abstraction. We quantitatively demonstrate the ability of the presented model to improve disentanglement in comparison to existing works on two benchmark datasets using three disentanglement metrics, including a new metric we proposed to complement the previously-presented metric of mutual information gap. We further present both qualitative and quantitative evidence on how the progression of learning improves disentangling of hierarchical representations. By drawing on the respective advantage of hierarchical representation learning and progressive learning, this is to our knowledge the first attempt to improve disentanglement by progressively growing the capacity of VAE to learn hierarchical representations.",
		"Keywords:": "generative model, disentanglement, progressive learning, VAE",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=SJxpsxrYPS",
		"pdf_link": "https://openreview.net/pdf?id=SJxpsxrYPS",
		"Code:": "https://docs.google.com/document/d/1qr-sROZ7q93OhigF6CoPde5NQ901wI17wmnBvbZRT9s/edit?fbclid=IwAR1HwkNZ1g2QgMmTGRZ0ktCYNgeKKk91tvRNLb59QJwU3dRmuGCJbTNMwj0"
	},
	{
		"title": "An Exponential Learning Rate Schedule for Deep Learning",
		"authors": "Zhiyuan Li,Sanjeev Arora",
		"emails": "zhiyuanli@cs.princeton.edu, arora@cs.princeton.edu",
		"TL;DR:": "We propose an exponentially growing learning rate schedule for networks with BatchNorm, which surprisingly performs well in practice and is provably equivalent to popular LR schedules like Step Decay.",
		"Abstract:": "Intriguing empirical evidence exists that deep learning can work well with exotic schedules for varying the learning rate. This paper suggests that the phenomenon may be due to Batch Normalization or BN(Ioffe & Szegedy, 2015), which is ubiq- uitous and provides benefits in optimization and generalization across all standard architectures. The following new results are shown about BN with weight decay and momentum (in other words, the typical use case which was not considered in earlier theoretical analyses of stand-alone BN (Ioffe & Szegedy, 2015; Santurkar et al., 2018; Arora et al., 2018)\n      • Training can be done using SGD with momentum and an exponentially in- creasing learning rate schedule, i.e., learning rate increases by some (1 + α) factor in every epoch for some α > 0. (Precise statement in the paper.) To the best of our knowledge this is the first time such a rate schedule has been successfully used, let alone for highly successful architectures. As ex- pected, such training rapidly blows up network weights, but the net stays well-behaved due to normalization.\n      • Mathematical explanation of the success of the above rate schedule: a rigor- ous proof that it is equivalent to the standard setting of BN + SGD + Standard Rate Tuning + Weight Decay + Momentum. This equivalence holds for other normalization layers as well, Group Normalization(Wu & He, 2018), Layer Normalization(Ba et al., 2016), Instance Norm(Ulyanov et al., 2016), etc.\n      • A worked-out toy example illustrating the above linkage of hyper- parameters. Using either weight decay or BN alone reaches global minimum, but convergence fails when both are used.",
		"Keywords:": "batch normalization, weight decay, learning rate, deep learning theory",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=rJg8TeSFDH",
		"pdf_link": "https://openreview.net/pdf?id=rJg8TeSFDH",
		"Code:": "https://docs.google.com/document/d/1qr-sROZ7q93OhigF6CoPde5NQ901wI17wmnBvbZRT9s/edit?fbclid=IwAR1HwkNZ1g2QgMmTGRZ0ktCYNgeKKk91tvRNLb59QJwU3dRmuGCJbTNMwj0"
	},
	{
		"title": "Geom-GCN: Geometric Graph Convolutional Networks",
		"authors": "Hongbin Pei,Bingzhe Wei,Kevin Chen-Chuan Chang,Yu Lei,Bo Yang",
		"emails": "gspeihongbing@163.com, bwei6@illinois.edu, kcchang@illinois.edu, csylei@comp.polyu.edu.hk, ybo@jlu.edu.cn",
		"TL;DR:": "For graph neural networks, the aggregation on a graph can benefit from a continuous space underlying the graph.",
		"Abstract:": "Message-passing neural networks (MPNNs) have been successfully applied in a wide variety of applications in the real world. However, two fundamental weaknesses of MPNNs' aggregators limit their ability to represent graph-structured data: losing the structural information of nodes in neighborhoods and lacking the ability to capture long-range dependencies in disassortative graphs. Few studies have noticed the weaknesses from different perspectives. From the observations on classical neural network and network geometry, we propose a novel geometric aggregation scheme for graph neural networks to overcome the two weaknesses.  The behind basic idea is the aggregation on a graph can benefit from a continuous space underlying the graph. The proposed aggregation scheme is permutation-invariant and consists of three modules, node embedding, structural neighborhood, and bi-level aggregation. We also present an implementation of the scheme in graph convolutional networks, termed Geom-GCN, to perform transductive learning on graphs. Experimental results show the proposed Geom-GCN achieved state-of-the-art performance on a wide range of open datasets of graphs.",
		"Keywords:": "Deep Learning, Graph Convolutional Network, Network Geometry",
		"Original Pdf:": "pdf",
		"forum_link": "https://openreview.net/forum?id=S1e2agrFvS",
		"pdf_link": "https://openreview.net/pdf?id=S1e2agrFvS",
		"Code:": "https://github.com/graphdml-uiuc-jlu/geom-gcn"
	}
]